{
    
    "rainyday": {
        "heroEmoji": "☔",
        "title": "A Message for a Rainy Day - Date Plan",
        "subtitle": "Date Plan",
        "heroTitle": "A Message for a Rainy Day",
        "heroSubtitle": "Create a personal Emotional First-Aid Kit filled with love, warmth, and heartfelt words for the future",
        "sectionTitle": "The Process: \"Warmth at the Tip of Your Pen\"",
        "checklist": [
            {
                "title": "The Tools",
                "items": [
                    "Beautiful paper",
                    "elegant envelopes",
                    "your favorite pens or even a quill and ink"
                ]
            },
            {
                "title": "The Props",
                "items": [
                    "Sealing wax and a stamp (for maximum atmosphere)",
                    "dried flowers or leaves to tuck inside the envelope"
                ]
            },
            {
                "title": "The Vibe",
                "items": [
                    "Soft, dim lighting",
                    "a few lit candles",
                    "calm background music (gentle jazz, instrumental melodies, or the soothing sound of rain outside)"
                ]
            }
        ],
        "dresscode": [
            {
                "emoji": "🧸",
                "title": "Keepers of the Cozy",
                "description": "Fluffy robes, warm blankets, and woolly socks"
            },
            {
                "emoji": "☔",
                "title": "Rainy Day Poets",
                "description": "Oversized sweaters, reading glasses, and a thoughtful mood"
            },
            {
                "emoji": "🌙",
                "title": "Pajama Classic",
                "description": "Your most loved, most comfortable pajamas"
            }
        ],
        "topics": {
            "show": true,
            "icon": "📋",
            "title": "What to Write About",
            "items": [
                "Recall a moment when you felt truly proud of your partner",
                "Describe the 3 qualities you adore most about them",
                "Give a funny, sweet piece of advice for when they feel like they're \"dropping all the balls\"",
                "Bring your shared dream to life by painting a vibrant picture of it"
            ]
        },
        "steps": [
            {
                "number": 1,
                "title": "The Letter Workshop",
                "content": "Settle into your cozy corners and write your partner a letter that is sincere, warm, and completely unguarded. The main goal is to be a source of support and to bring a genuine smile to their face when the letter is finally opened down the road.",
                "ideas": [
                    "Tuck in something symbolic: A ticket stub from your first movie date, a pressed flower, or a tiny doodle",
                    "Spritz the paper with your signature scent to add an extra dimension of memory"
                ]
            },
            {
                "number": 2,
                "title": "The Sealing Ritual",
                "content": "Once finished, the letters are folded and sealed in their envelopes. The contents must remain a complete secret until Day \"X.\" That element of intrigue is what creates the real magic.",
                "ideas": [
                    "Use a wax seal with your initials or a heart symbol",
                    "Invent and draw your own coat of arms or a secret couple's sign on the envelope"
                ]
            },
            {
                "number": 3,
                "title": "Rules of the Game",
                "content": "Discuss and agree on the one condition that will allow each of you to break the seal. This rule must be the same for both of you. It could be an emotional state or a specific situation.",
                "ideas": [
                    "\"Open when you feel like you're alone\"",
                    "\"Open after our silliest fight\"",
                    "\"Open on the day the rain outside is the grimmest and gloomiest\""
                ]
            },
            {
                "number": 4,
                "title": "The Final Act",
                "content": "Pick a special place for your letters—a beautiful decorative box, an old wine crate, or a secret shelf in the bookcase—where they will wait for their moment.",
                "ideas": [
                    "Take a photo as you place the letters into their \"vault.\" That picture will be the very first exhibit in your future \"Gallery of Warm Memories\""
                ]
            }
        ]
    },
    "cinemarevelation": {
        "heroEmoji": "📺",
        "title": "Cinema Revelation - Date Plan",
        "subtitle": "Date Plan",
        "heroTitle": "Cinema Revelation",
        "heroSubtitle": "This evening isn't just about movies—it's a chance to know each other more deeply through the stories that shaped you",
        "sectionTitle": "The Process: \"Private Screening for Two\"",
        "checklist": [
            {
                "title": "Tickets",
                "items": [
                    "3 films from each person that hold special meaning (from childhood, youth, or connected to an important event)"
                ]
            },
            {
                "title": "Cinema Bar",
                "items": [
                    "Popcorn (salty and sweet)",
                    "nachos",
                    "favorite drinks and treats"
                ]
            },
            {
                "title": "Atmosphere",
                "items": [
                    "Curtains drawn",
                    "soft glow of string lights",
                    "soundtracks from favorite films playing in the background"
                ]
            }
        ],
        "dresscode": [
            {
                "emoji": "🎬",
                "title": "Red Carpet on the Couch",
                "description": "Silk pajamas or cozy robes"
            },
            {
                "emoji": "🎭",
                "title": "Couch Critics",
                "description": "Comfortable sweaters, glasses, and blankets"
            },
            {
                "emoji": "🍿",
                "title": "Blockbuster Heroes",
                "description": "Fun onesies or pajamas with favorite characters"
            }
        ],
        "topics": {
            "show": true,
            "icon": "💭",
            "title": "Discussion Topics",
            "items": [
                "Why is this film so important to you?",
                "Which scenes trigger the strongest emotions?",
                "Which character resonates with you most?",
                "What personal stories are connected to this movie?",
                "Which of your mutual friends do the characters remind you of?",
                "What unexpected sides did you discover in each other?"
            ]
        },
        "steps": [
            {
                "number": 1,
                "title": "Pre-Show: Secret Selection",
                "content": "Each person prepares a list of three significant films. Take turns briefly explaining why these movies are dear to you, without revealing everything and without naming your top favorite. After the presentations, each of you chooses one film from your partner's list for tonight's viewing.",
                "ideas": [
                    "Create an intriguing description for each film on your list, like a movie poster",
                    "Draw lots if the choice is too difficult"
                ]
            },
            {
                "number": 2,
                "title": "First Act: Their Story",
                "content": "You watch the film chosen from your partner's list. Your task isn't just to follow the plot, but to try to feel why this movie is so important to them. Which scenes trigger emotions? Which character resonates with them?",
                "ideas": [
                    "Keep a notebook handy and discreetly jot down your guesses or moments when your partner reacted strongly",
                    "Try to guess their favorite quote from the film"
                ]
            },
            {
                "number": 3,
                "title": "Intermission: Trading Theories",
                "content": "After watching the first film, have a discussion. Start with guesses: \"I think this film speaks to you because...\" Then your partner reveals the real reason and shares personal stories connected to the movie.",
                "ideas": [
                    "Create your own rating system: not stars, but maybe \"popcorn kernels\" or \"cozy blankets\"",
                    "Discuss which of your mutual friends the characters remind you of"
                ]
            },
            {
                "number": 4,
                "title": "Final Act: Our Shared Filmography",
                "content": "Switch roles, watch the film from your list, and repeat the ritual with discussion. At the end, compare impressions: what unexpected sides did you discover in each other?",
                "ideas": [
                    "Start a list in your phone notes or in a beautiful notebook called \"Our Golden Film Collection.\" Add these two films and agree to keep adding to it after each movie night like this"
                ]
            }
        ]
    },
    "whisperofpages": {
        "heroEmoji": "📖",
        "title": "Whisper of Pages - Date Plan",
        "subtitle": "Date Plan",
        "heroTitle": "Whisper of Pages",
        "heroSubtitle": "Sometimes, to take a journey, you don't need to leave home. This evening is dedicated to the magic of reading aloud",
        "sectionTitle": "The Process: \"When the Story Comes Alive\"",
        "checklist": [
            {
                "title": "Script",
                "items": [
                    "A short story (30-60 minutes of reading) that neither of you knows yet"
                ]
            },
            {
                "title": "Refreshments",
                "items": [
                    "Hot chocolate",
                    "cocoa with marshmallows",
                    "or mulled wine",
                    "light cookies"
                ]
            },
            {
                "title": "Audience Seating",
                "items": [
                    "A cozy nest of pillows and blankets",
                    "dim light from a floor lamp or candles"
                ]
            }
        ],
        "dresscode": [
            {
                "emoji": "📚",
                "title": "Librarians",
                "description": "Cozy cardigans, warm socks, and perhaps glasses for gravitas"
            },
            {
                "emoji": "📖",
                "title": "Storytellers",
                "description": "Soft pajamas or onesies that make it easy to imagine yourself as a character"
            },
            {
                "emoji": "☕",
                "title": "Book Club",
                "description": "Comfortable sweatshirts and blankets you can wrap yourself in completely"
            }
        ],
        "topics": {
            "show": true,
            "icon": "📚",
            "title": "Story Suggestions",
            "items": [
                "Ray Bradbury — \"The Vacation\" or \"The Smile\" (short, warm, with a touch of melancholy)",
                "O. Henry — \"The Gift of the Magi\" (a classic that always touches the heart deeply)",
                "Alexander Green — \"The Green Lamp\" (a bit fairy-tale-like with faith in dreams)",
                "Ursula K. Le Guin — \"The Ones Who Walk Away from Omelas\" (short, philosophical, sparks long discussions)",
                "Haruki Murakami — \"On Seeing the 100% Perfect Girl One Beautiful April Morning\" (tender and slightly absurd)"
            ]
        },
        "steps": [
            {
                "number": 1,
                "title": "Role Distribution: Narrator and Voice",
                "content": "Decide how you'll read. You can take turns—by paragraphs or pages. Or you can create real theater: one reads the author's words, and the other voices the characters.",
                "ideas": [
                    "Try changing your voice to portray different characters. Don't be afraid to overact—it's fun!",
                    "If there are sounds in the story (a door knock, wind howling), act them out"
                ]
            },
            {
                "number": 2,
                "title": "Diving into the Plot: The Magic of Intonation",
                "content": "Start reading aloud, without rushing. Enjoy the timbre of your partner's voice, pour emotion into the words, play with intonation—from whispers to exclamations. Your goal isn't speed, but atmosphere.",
                "ideas": [
                    "Use your phone's flashlight to illuminate the text, creating a mysterious setting",
                    "Play ambient or instrumental music in the background that fits the story's mood"
                ]
            },
            {
                "number": 3,
                "title": "Bookmark on the Page: Pause for Thoughts",
                "content": "Don't be afraid to stop at the most interesting moments. Take pauses to share thoughts or ask each other questions.",
                "ideas": [
                    "\"What do you think he'll do next? What would you do in his place?\"",
                    "\"Do you feel sympathy for this character? Why?\"",
                    "\"This situation reminds me of something from our life...\""
                ]
            },
            {
                "number": 4,
                "title": "Final Touch: After the Epilogue",
                "content": "When the story is finished, don't rush back to reality. Discuss the ending: what does it mean to you? What emotions did the story leave? What details did one notice that the other missed?",
                "ideas": [
                    "Come up with and write down one sentence as a continuation—\"And a year later, the characters...\" Save this note as an artifact of your literary evening"
                ]
            }
        ]
    },
    "artdialogue": {
        "heroEmoji": "🖌️",
        "title": "Art Dialogue - Date Plan",
        "subtitle": "Date Plan",
        "heroTitle": "Art Dialogue",
        "heroSubtitle": "Sometimes feelings are easier to express not with words, but with color and form. This date turns you into a duo of artists creating a shared canvas",
        "sectionTitle": "The Process: \"Conversation on Canvas\"",
        "checklist": [
            {
                "title": "Canvas",
                "items": [
                    "One large sheet of drawing paper or canvas on a stretcher",
                    "two sets of paints (gouache or acrylic)",
                    "brushes",
                    "palette",
                    "water cups"
                ]
            },
            {
                "title": "Studio",
                "items": [
                    "Cover the floor or table with plastic",
                    "ensure good lighting"
                ]
            },
            {
                "title": "Atmosphere",
                "items": [
                    "Put on a creative playlist (from light jazz to indie rock)",
                    "light an aromatic candle"
                ]
            }
        ],
        "dresscode": [
            {
                "emoji": "🎨",
                "title": "Free Artists",
                "description": "Old white t-shirts that will become part of the art object"
            },
            {
                "emoji": "🖌️",
                "title": "Masters of Bohemia",
                "description": "Berets, scarves, and creative chaos in clothing"
            },
            {
                "emoji": "👕",
                "title": "Art Therapists",
                "description": "Maximally comfortable tracksuits"
            }
        ],
        "topics": {
            "show": false
        },
        "steps": [
            {
                "number": 1,
                "title": "Monologue in Color: First Touch",
                "content": "Divide the canvas in half (mentally or with a light pencil line). For 10-15 minutes, each person silently paints on their half, expressing their current mood or emotion. Don't think about the subject, trust your intuition.",
                "ideas": [
                    "Try to paint music: smooth lines for slow melodies, sharp strokes for fast ones",
                    "Depict your day in color: yellow spots of joy, gray streaks of tiredness"
                ]
            },
            {
                "number": 2,
                "title": "Response Gesture: Continuing the Story",
                "content": "Now the most interesting part: switch places. Your task isn't to redo, but to complement your partner's drawing. Respond to their colors with yours, connect their lines with yours, turn their abstract spot into something new.",
                "ideas": [
                    "If your partner drew a circle, turn it into a sun, planet, or eye",
                    "Draw your lines across the border, symbolically uniting the two halves—anything is allowed"
                ]
            },
            {
                "number": 3,
                "title": "Duet: Final Touches",
                "content": "Return to your places or work on the painting together, no longer dividing it into halves. Add finishing accents that will make the canvas a unified whole.",
                "ideas": [
                    "Find a place in the center of the painting for a shared symbol, meaningful only to you",
                    "Leave handprints on the canvas, intertwined together"
                ]
            },
            {
                "number": 4,
                "title": "Final Touch: Gallery Opening for Two",
                "content": "Put the finished painting in a visible place. Hold a playful presentation: take turns telling what you wanted to depict and what you saw in your partner's work.",
                "ideas": [
                    "Come up with a title for your painting and take a photo with it, as if at a gallery opening. This canvas will become not just decor, but a true relic of your union"
                ]
            }
        ]
    },
    "mapofhorizons": {
        "heroEmoji": "🗺️",
        "title": "Map of Horizons - Date Plan",
        "subtitle": "Date Plan",
        "heroTitle": "Map of Horizons",
        "heroSubtitle": "Dreaming alone is pleasant, but dreaming together means charting a course to a shared future. This date turns abstract wishes into a visible treasure map",
        "sectionTitle": "The Process: \"Charting the Course\"",
        "checklist": [
            {
                "title": "Tools",
                "items": [
                    "Large sheet of drawing paper or cork board",
                    "colored markers",
                    "pens",
                    "sticky notes"
                ]
            },
            {
                "title": "Props",
                "items": [
                    "Old magazines for cutouts",
                    "scissors",
                    "glue",
                    "pushpins"
                ]
            },
            {
                "title": "Atmosphere",
                "items": [
                    "Spacious spot on the floor or at a large table",
                    "soft lighting",
                    "inspiring playlist (soundtracks from motivational films, epic music)"
                ]
            }
        ],
        "dresscode": [
            {
                "emoji": "📐",
                "title": "Architects of the Future",
                "description": "Comfortable but neat home clothes (shirts, polos)"
            },
            {
                "emoji": "💭",
                "title": "Great Dreamers",
                "description": "Cozy pajamas or onesies"
            },
            {
                "emoji": "✈️",
                "title": "Time Travelers",
                "description": "Clothes that remind you of your favorite trips"
            }
        ],
        "topics": {
            "show": false
        },
        "steps": [
            {
                "number": 1,
                "title": "Near Horizon: \"One Year\" Section",
                "content": "In the center of the map, draw a circle or column labeled \"Our Next Year.\" Fill it with concrete, achievable plans for the next 12 months. These can be both small joys and important steps.",
                "ideas": [
                    "Use different colored sticky notes for categories: \"Travel,\" \"Skills,\" \"Purchases,\" \"Experiences\"",
                    "Examples: \"Weekend trip to a nearby city,\" \"Learn to cook paella together,\" \"Take a massage course,\" \"Once a month, have a surprise date\""
                ]
            },
            {
                "number": 2,
                "title": "Middle Distance: \"Five Years\" Section",
                "content": "Around the central zone, create a \"Our Five-Year Plan\" section. Here you can place larger, more ambitious goals requiring time and preparation.",
                "ideas": [
                    "Use magazine cutouts for visualization: dream house, dog breed, country for a big trip",
                    "Examples: \"Get a corgi named Bagel,\" \"Save for a down payment,\" \"Learn Italian for a trip to Tuscany,\" \"Run a half-marathon\""
                ]
            },
            {
                "number": 3,
                "title": "Distant Stars: \"Ten Years and Beyond\" Section",
                "content": "On the edges of the map, place your boldest, most boundless fantasies. In this section, there's no such word as \"impossible.\" Allow yourself to dream big.",
                "ideas": [
                    "Don't limit yourself to reality. Write down everything that comes to mind",
                    "Examples: \"Open a little café by the sea,\" \"Write a book together,\" \"Live abroad for a year,\" \"Collect a vinyl record collection\""
                ]
            },
            {
                "number": 4,
                "title": "Final Touch: Compass Check",
                "content": "When the map is ready, hang it in a visible place. Look at it from a distance and discuss: which dreams overlapped? What was a revelation about your partner's desires?",
                "ideas": [
                    "Choose one small dream from the \"One Year\" section and agree to take the first step toward making it happen next week. Photograph your map—let it become your phone wallpaper"
                ]
            }
        ]
    },
    "storyinframes": {
        "heroEmoji": "📷",
        "title": "Story in Frames - Date Plan",
        "subtitle": "Date Plan",
        "heroTitle": "Story in Frames",
        "heroSubtitle": "In our phone galleries are gigabytes of memories we rarely revisit. This date is a chance to rescue the best moments from digital oblivion",
        "sectionTitle": "The Process: \"Flipping Through Memory\"",
        "checklist": [
            {
                "title": "Materials",
                "items": [
                    "Empty photo album with cardboard pages",
                    "glue stick",
                    "scissors",
                    "double-sided tape"
                ]
            },
            {
                "title": "Decorations",
                "items": [
                    "Colored pens",
                    "decorative stickers",
                    "washi tape",
                    "scraps of beautiful paper"
                ]
            },
            {
                "title": "Content",
                "items": [
                    "Pre-selected (or printed) 30-50 photos together"
                ]
            },
            {
                "title": "Atmosphere",
                "items": [
                    "Spacious, well-lit spot",
                    "nostalgic playlist with songs that were popular at the start of your relationship"
                ]
            }
        ],
        "dresscode": [
            {
                "emoji": "📸",
                "title": "Memory Keepers",
                "description": "Cozy vintage-style sweaters"
            },
            {
                "emoji": "📼",
                "title": "Archivists",
                "description": "Comfortable home clothes you can sit on the floor in for hours"
            },
            {
                "emoji": "🖼️",
                "title": "Photo Chronicle Heroes",
                "description": "Matching t-shirts or clothes in the same color scheme"
            }
        ],
        "topics": {
            "show": false
        },
        "steps": [
            {
                "number": 1,
                "title": "Casting: Finding the Best Shots",
                "content": "If you haven't done this beforehand, start with the most engaging part—selecting photos together. Rule: each person chooses 20-25 shots. Be sure to include not only beautiful ones, but funny, silly, and candid shots too.",
                "ideas": [
                    "Create award categories: \"Silliest Selfie,\" \"Photo Better Never Shown to Anyone,\" \"Shot Full of Love\"",
                    "Find your very first photo together"
                ]
            },
            {
                "number": 2,
                "title": "Direction: Storyboarding",
                "content": "Lay all selected photos on the floor and decide in what order they'll appear in the album. Will it be strict chronology or thematic spreads?",
                "ideas": [
                    "Thematic spreads: \"Our Travels,\" \"Conquering Culinary Heights,\" \"Home Silliness,\" \"Celebrations\"",
                    "You could start with recent photos and move backward to the beginning of your relationship, like in the movie \"Memento\""
                ]
            },
            {
                "number": 3,
                "title": "Chronicle: Pages Come to Life",
                "content": "The most creative stage: glue in photos and add captions. Don't limit yourself to dates and locations. Write jokes, quotes born that day, or little stories.",
                "ideas": [
                    "Come up with funny captions from the perspective of people in the photos",
                    "Draw little doodles around photos: hearts, arrows, suns",
                    "Paste not only photos but tickets, receipts, or pressed flowers connected to that day"
                ]
            },
            {
                "number": 4,
                "title": "Final Touch: Premiere Showing",
                "content": "When the last page is filled, hold a ceremonial presentation. Slowly flip through the album from beginning to end, sharing memories that didn't fit in the captions.",
                "ideas": [
                    "On the last page, leave space for a new photo you'll take right now, holding the finished album. This will be a beautiful full stop and simultaneously the beginning of a new chapter"
                ]
            }
        ]
    },
    "ourrhymes": {
        "heroEmoji": "✒️",
        "title": "Our Rhymes - Date Plan",
        "subtitle": "Date Plan",
        "heroTitle": "Our Rhymes",
        "heroSubtitle": "You don't need to be a poet to talk about feelings in verse. This date is a playful game with words, rhythm, and memories",
        "sectionTitle": "The Process: \"When Words Find Rhythm\"",
        "checklist": [
            {
                "title": "Tools",
                "items": [
                    "Paper and pens",
                    "notebooks",
                    "or even one large board with markers"
                ]
            },
            {
                "title": "Inspiration",
                "items": [
                    "You can grab a poetry collection (like the amusing 'gariki' by Igor Guberman or lyrics by Vera Polozkova)"
                ]
            },
            {
                "title": "Atmosphere",
                "items": [
                    "Soft candlelight",
                    "quiet background music (instrumental jazz or lounge)"
                ]
            }
        ],
        "dresscode": [
            {
                "emoji": "🎩",
                "title": "Bohemia",
                "description": "Turtlenecks, berets, and artsy scarves"
            },
            {
                "emoji": "📝",
                "title": "Couch Poets",
                "description": "Cozy sweaters and warm socks"
            },
            {
                "emoji": "✍️",
                "title": "Rhyme Weavers",
                "description": "Funny pajamas that set a lighthearted mood"
            }
        ],
        "topics": {
            "show": true,
            "icon": "📋",
            "title": "Poem Topic Ideas",
            "items": [
                "\"Ode to Our Cat (or Other Pet)\"",
                "\"Ballad About How We Chose Wallpaper\"",
                "\"Epic of the First Date\"",
                "\"Haiku About Morning Coffee\"",
                "\"Epic Saga of the Trip to IKEA\""
            ]
        },
        "steps": [
            {
                "number": 1,
                "title": "First Line: Setting the Theme",
                "content": "Start by choosing a topic. It can be something grand and romantic or, conversely, maximally mundane and funny. The simpler the topic, the funnier the result.",
                "ideas": [
                    "Write several topics on slips of paper and draw one randomly",
                    "Choose the brightest shared memory from the last month"
                ]
            },
            {
                "number": 2,
                "title": "Poetic Relay: Stanza by Stanza",
                "content": "There are several game options. You can write one line at a time, trying to continue your partner's thought and rhyme. Or each person can write a quatrain on the given topic, then combine them.",
                "ideas": [
                    "Try the Japanese \"renga\" format, where each person writes three or two lines, continuing the previous ones",
                    "Make it harder: agree that the poem must include the words \"pineapple,\" \"cosmodrome,\" and \"sock\""
                ]
            },
            {
                "number": 3,
                "title": "Bouts-Rimés: Rhyme Game",
                "content": "Another fun variation. One of you writes two rhyming lines on paper, folds the sheet so only the second line is visible, and passes it to your partner. They come up with a rhyme for the visible line, fold the sheet again, and pass it back. At the end, you unfold it and read the resulting absurd masterpiece.",
                "ideas": [
                    "Try this multiple times to create a collection of funny verses"
                ]
            },
            {
                "number": 4,
                "title": "Final Touch: Author's Reading",
                "content": "When the poems are ready, hold a \"poetry evening.\" With expression and drama, read to each other what you've created. Applause is mandatory!",
                "ideas": [
                    "Choose the best or funniest poem, beautifully rewrite it on a postcard, and hang it on the fridge as a manifesto of your creative union"
                ]
            }
        ]
    },
    "freezeframe": {
        "heroEmoji": "🤳",
        "title": "Freeze Frame - Date Plan",
        "subtitle": "Date Plan",
        "heroTitle": "Freeze Frame",
        "heroSubtitle": "Professional photo shoots are beautiful, but the most alive and genuine shots are born from goofing around when nobody's posing",
        "sectionTitle": "The Process: \"Our Home Photo Chronicle\"",
        "checklist": [
            {
                "title": "Equipment",
                "items": [
                    "Camera or phone with timer",
                    "tripod (or substitute—stack of books, chair)"
                ]
            },
            {
                "title": "Props",
                "items": [
                    "Everything at hand—hats, glasses, scarves, blankets, string lights, sparklers, glasses, favorite mug"
                ]
            },
            {
                "title": "Locations",
                "items": [
                    "Choose 2-3 spots in the house with good light or interesting background (windowsill, couch with pillows, kitchen, hallway mirror)"
                ]
            },
            {
                "title": "Atmosphere",
                "items": [
                    "Energetic, fun playlist that makes you move and smile"
                ]
            }
        ],
        "dresscode": [
            {
                "emoji": "👗",
                "title": "Supermodels on the Couch",
                "description": "Beautiful matching pajamas or robes"
            },
            {
                "emoji": "🎭",
                "title": "Comedy Heroes",
                "description": "Bright, fun, or even ridiculous clothing"
            },
            {
                "emoji": "⚫",
                "title": "Total Black/White",
                "description": "Dress in one color, always looks stylish in photos"
            }
        ],
        "topics": {
            "show": false
        },
        "steps": [
            {
                "number": 1,
                "title": "Studio Setup: Lights, Camera, Action!",
                "content": "Organize shooting zones. Set your phone on timer (burst mode for 10-20 shots is your best friend), adjust lighting, arrange props within reach.",
                "ideas": [
                    "Build a fort from pillows and blankets—it's a great backdrop and cozy hideaway",
                    "Use string lights to create beautiful bokeh lights in the background"
                ]
            },
            {
                "number": 2,
                "title": "Classic Genre: Posed Shots",
                "content": "Start with simple, sweet poses to warm up. Hugs, kisses, doing something together (reading a book, drinking cocoa).",
                "ideas": [
                    "Try recreating a shot from a famous romantic film (\"Titanic\" on the couch, \"Ghost\" in the kitchen)",
                    "Make a series of \"photo booth\" photos: four quick frames with different funny faces"
                ]
            },
            {
                "number": 3,
                "title": "\"Live\" Mode: Capture the Moment",
                "content": "This is the main stage. Set burst mode on timer and just live: dance, have pillow fights, make sandwiches together, laugh, tell each other jokes. The best shots happen when you forget about the camera.",
                "ideas": [
                    "Turn on a favorite upbeat song and dance wildly",
                    "Try giving each other funny hairstyles"
                ]
            },
            {
                "number": 4,
                "title": "Final Touch: One-Evening Exhibition",
                "content": "After the shoot, get comfortable and look through everything you captured. Don't delete failed shots—they're often the funniest.",
                "ideas": [
                    "Choose 3 winners in categories: \"Most Romantic Shot,\" \"Funniest Fail,\" and \"Photo That Needs to Be Printed.\" Create a separate album on your phone named after this evening"
                ]
            }
        ]
    },
    "academyfortwo": {
         "heroEmoji": "🎒",
        "title": "Academy for Two - Date Plan",
        "subtitle": "Date Plan",
        "heroTitle": "Academy for Two",
        "heroSubtitle": "We often know what coffee our partner likes, but don't always realize what universe hides in their hobbies. This date is a chance to become professor and student for each other",
        "sectionTitle": "The Process: \"Scientific Symposium of Love\"",
        "checklist": [
            {
                "title": "Talking Points",
                "items": [
                    "Each person chooses beforehand a topic for their 15-minute 'lecture'"
                ]
            },
            {
                "title": "Visual Aids",
                "items": [
                    "Can use laptop for presentation",
                    "whiteboard with markers",
                    "or just a notebook with drawings"
                ]
            },
            {
                "title": "Atmosphere",
                "items": [
                    "Create an 'academic' setting—desk lamp, chair as 'podium'",
                    "quiet background music (classical or neoclassical)"
                ]
            }
        ],
        "dresscode": [
            {
                "emoji": "🎓",
                "title": "Professoriate",
                "description": "Blazer or cardigan over home clothes, glasses for gravitas"
            },
            {
                "emoji": "📚",
                "title": "Eternal Students",
                "description": "Cozy university sweatshirts and hoodies"
            },
            {
                "emoji": "🎧",
                "title": "Auditors",
                "description": "Comfortable pajamas, ready to absorb knowledge while lying down"
            }
        ],
        "topics": {
            "show": true,
            "icon": "📋",
            "title": "Lecture Topic Examples",
            "items": [
                "\"Why This Music Album Is the Greatest in History: Analysis with Examples\"",
                "\"Fundamentals of Perfect Tea Brewing: From Temperature to Mood\"",
                "\"Brief History of My Favorite Video Game: Why It's Art\"",
                "\"Philosophy of Cats: What Our Pets Teach Us\"",
                "\"How Offside Works in Soccer: Explanation for Non-Athletes\""
            ]
        },
        "steps": [
            {
                "number": 1,
                "title": "Lecture #1: The World of One of Us",
                "content": "The first \"professor\" steps up to the \"podium\" and gives their lecture. The goal is to talk about your passion enthusiastically, interestingly, and simply. The listener can ask clarifying questions and take notes.",
                "ideas": [
                    "Use objects in the room as visual aids",
                    "Include one funny, little-known fact about your topic in the lecture"
                ]
            },
            {
                "number": 2,
                "title": "Coffee Break: Scientific Debates",
                "content": "After the first lecture, take a small break. Pour tea or coffee, have a cookie, and discuss what you heard. This is time for tricky questions, jokes, and exchanging first impressions.",
                "ideas": [
                    "Try to argue with one of the lecturer's points, even if you agree",
                    "Think of how the knowledge gained could be applied in your life together"
                ]
            },
            {
                "number": 3,
                "title": "Lecture #2: New Universe",
                "content": "Now the \"professors\" switch places. The second partner presents their topic, trying to captivate the listener just as their predecessor did.",
                "ideas": [
                    "Try to find an unexpected connection between your topic and theirs",
                    "End the lecture with a practical assignment you can do together (for example, \"now let's try listening to this song in a new way\")"
                ]
            },
            {
                "number": 4,
                "title": "Final Touch: Diploma Ceremony",
                "content": "At the end of the evening, discuss what new things you learned about each other. What surprised you most? Which of your partner's passions did you want to share?",
                "ideas": [
                    "Draw playful diplomas for each other \"For Best Lecture About...\" or \"Honorary Expert in...\" Hang them in a visible place as a symbol of successfully completing your \"Academy\""
                ]
            }
        ]
    },
    "flavorsoflove": {
         "heroEmoji": "🍝",
        "title": "Flavors of Love - Date Plan",
        "subtitle": "Date Plan",
        "heroTitle": "Flavors of Love",
        "heroSubtitle": "The kitchen isn't just a place for cooking—it's a real stage for creativity, improvisation, and care. This date is a culinary duel where there are no losers",
        "sectionTitle": "The Process: \"Culinary Duel\"",
        "checklist": [
            {
                "title": "Menu",
                "items": [
                    "Secretly or openly find out each other's favorite dish (one you can actually cook)"
                ]
            },
            {
                "title": "Shopping",
                "items": [
                    "Go grocery shopping together, turning it into part of the adventure. You can split the list and race to find ingredients"
                ]
            },
            {
                "title": "Props",
                "items": [
                    "Beautiful aprons",
                    "chef's hats for laughs",
                    "all necessary kitchen utensils"
                ]
            },
            {
                "title": "Atmosphere",
                "items": [
                    "Energetic playlist (from Italian pop to rock 'n' roll)",
                    "good lighting",
                    "and a glass of wine for the chefs"
                ]
            }
        ],
        "dresscode": [
            {
                "emoji": "👨‍🍳",
                "title": "Head Chefs",
                "description": "White t-shirts and stylish aprons"
            },
            {
                "emoji": "🍷",
                "title": "Restaurant Critics",
                "description": "Elegant but comfortable home attire"
            },
            {
                "emoji": "🧑‍🍳",
                "title": "Kitchen Experimenters",
                "description": "Whatever you don't mind getting flour on"
            }
        ],
        "topics": {
            "show": false
        },
        "steps": [
            {
                "number": 1,
                "title": "On Your Marks, Get Set, Cook!",
                "content": "Start cooking simultaneously in different parts of the kitchen. The task is to prepare your partner's favorite dish, pouring all your love and a bit of creativity into it.",
                "ideas": [
                    "Have a \"knife battle\"—who can chop vegetables faster and more beautifully",
                    "You can cook with backs to each other to keep the intrigue until the very end"
                ]
            },
            {
                "number": 2,
                "title": "Kitchen Show: Creative Chaos",
                "content": "Turn the process into a cooking show. Comment on each other's actions, conduct playful interviews (\"Chef, what's the secret of your sauce?\"), hold blind taste tests of ingredients.",
                "ideas": [
                    "Come up with an exquisite restaurant name for your dish",
                    "Try repeating some trick from famous chefs (carefully though!)"
                ]
            },
            {
                "number": 3,
                "title": "Judgment Day: Ceremonial Tasting",
                "content": "When the dishes are ready, beautifully set the table. First present your creations, then taste. Evaluate not only flavor but presentation, originality, and amount of love invested.",
                "ideas": [
                    "Award each other playful Michelin stars or prizes in categories: \"Most Soulful Dish,\" \"For Will to Win,\" \"Best Aroma\"",
                    "Try to guess the \"secret ingredient\" your partner added"
                ]
            },
            {
                "number": 4,
                "title": "Final Touch: Recipe for Our Evening",
                "content": "After dinner full of compliments and laughter, relax and discuss your culinary experience. Cleaning can also be part of the date—turn on music and dance with the mop.",
                "ideas": [
                    "Start a \"Book of Our Recipes\" and write these two dishes in it as the very first entries, definitely adding the date and a couple of funny moments from this evening"
                ]
            }
        ]
    },
    "temporaryink": {
        "heroEmoji": "🎨",
        "title": "Temporary Ink - Date Plan",
        "subtitle": "Date Plan",
        "heroTitle": "Temporary Ink",
        "heroSubtitle": "Today you'll create paintings that can't be hung on a wall—because they live on the body. An evening about attention, contact, and inspiration",
        "sectionTitle": "The Process: \"Body as Art Form\"",
        "checklist": [
            {
                "title": "Space",
                "items": [
                    "Create a cozy 'studio': cover the floor or bed with fabric",
                    "place a bowl of warm water nearby",
                    "soft towels",
                    "napkins"
                ]
            },
            {
                "title": "Props",
                "items": [
                    "Body paints or face paint (can add gold or pearlescent accents)",
                    "brushes of different sizes, sponges, cotton swabs",
                    "timer or music playlist",
                    "mirror to admire the results"
                ]
            },
            {
                "title": "Atmosphere",
                "items": [
                    "Warm lighting",
                    "instrumental music with rhythm that helps concentration",
                    "light chill or soundtracks (In the Mood for Love, Massive Attack, Alt-J)",
                    "add scent: sandalwood, vanilla, or orange zest"
                ]
            }
        ],
        "dresscode": [
            {
                "emoji": "🎨",
                "title": "Artist and Canvas",
                "description": "White shirt, open shoulders or back"
            },
            {
                "emoji": "👕",
                "title": "Creative Studio",
                "description": "Old t-shirts and shorts you don't mind getting dirty"
            },
            {
                "emoji": "🧖",
                "title": "Minimalism",
                "description": "Just a blanket or towel, keeping skin exposed"
            }
        ],
        "topics": {
            "show": false
        },
        "steps": [
            {
                "number": 1,
                "title": "Warm-Up: \"Guess the Drawing\"",
                "content": "One person closes their eyes, the other draws simple shapes—a star, zigzag, spiral, arrow, letter. The task is to guess what's being drawn.",
                "ideas": [
                    "Try drawing everything on one body area—for example, on the back or stomach, to 'awaken' touch and attention"
                ]
            },
            {
                "number": 2,
                "title": "Silent Canvas: \"I Draw What I Feel\"",
                "content": "Now guessing stops, and pure creativity begins. One person is the canvas, the other is the artist. The artist draws what they feel in the moment: not a subject, but a mood. These can be lines, strokes, spots—anything that reflects inner rhythm. While one draws, the other listens to music, focusing on sensations.",
                "ideas": [
                    "Try drawing to music—let each track dictate its own color and movement",
                    "Choose a body part—for example, arm, back, leg—and turn it into a 'mini-painting'"
                ]
            },
            {
                "number": 3,
                "title": "Reflection: \"Your Mark on Me\"",
                "content": "Now you switch roles. But this time the artist doesn't draw what they feel inside, but how they perceive their partner—their energy, mood, character. To stay focused, use these prompts:",
                "ideas": [
                    "\"I draw only with round shapes\"—about your partner's softness and tenderness",
                    "\"Only in blue\"—about their favorite color",
                    "\"As if my partner is an element\" (fire, water, air, earth)",
                    "You can set a time limit—for example, 5 minutes per drawing, so you don't overthink and draw intuitively"
                ]
            },
            {
                "number": 4,
                "title": "Photograph Your Artwork",
                "content": "When a drawing is on the body—it lives briefly. Photos help preserve this moment, mood, and see yourself through another's eyes. Have a small photoshoot of each other.",
                "ideas": [
                    "You can create interesting titles for your drawings, as if in a contemporary art gallery"
                ]
            },
            {
                "number": 5,
                "title": "Final Touch: \"Washing Away, Leaving Behind\"",
                "content": "Carefully wash off the paint from each other with warm water, sponge, or cloth. Do this slowly, as a continuation of the ritual. Then wrap yourselves in towels or blankets, make tea.",
                "ideas": [
                    "Discuss what you felt during the process, which drawings resonated most, what surprised you about seeing yourself as art"
                ]
            }
        ]
    },

    "eveningquestionnaire": {
        "heroEmoji": "❔",
        "title": "Evening Questionnaire - Date Plan",
        "subtitle": "Date Plan",
        "heroTitle": "Evening Questionnaire",
        "heroSubtitle": "An exciting game of 'spies' where you test how well you know each other's habits and secrets. Not so much a chance to win as it is a chance to be surprised and learn something new",
        "sectionTitle": "Process: \"Operation 'Sincere'\"",
        "checklist": [
            {
                "title": "Dossier",
                "items": [
                    "Each person secretly prepares a list of 10-15 questions about themselves in advance"
                ]
            },
            {
                "title": "Tools",
                "items": [
                    "Paper and pens for answers",
                    "erasable boards can be used"
                ]
            },
            {
                "title": "Atmosphere",
                "items": [
                    "Dim table lamp lighting",
                    "soundtracks from spy films or mysterious jazz playing in the background"
                ]
            }
        ],
        "dresscode": [
            {
                "emoji": "🕵️",
                "title": "Private Detectives",
                "description": "Dressing gowns worn like cloaks and a serious expression"
            },
            {
                "emoji": "🖤",
                "title": "Keepers of Secrets",
                "description": "All black, like real secret agents"
            },
            {
                "emoji": "👓",
                "title": "Analysts",
                "description": "Cosy jumpers and glasses (even if you have perfect vision)"
            }
        ],
        "topics": {
            "show": true,
            "icon": "❓",
            "title": "Sample Questions",
            "items": [
                "What is my favourite season and why?",
                "What film could I watch over and over again?",
                "What superpower would I choose?",
                "What is the most ridiculous purchase I still laugh about?",
                "Who was my first friend at school?"
            ]
        },
        "steps": [
            {
                "number": 1,
                "title": "Biased Questioning: Round One",
                "content": "One of you becomes the 'agent' and reads out your questions. The second ('subject') answers, trying to guess the correct answer. The agent maintains an air of mystery and remains impassive.",
                "ideas": [
                    "Ask questions with different intonations to confuse the 'subject'",
                    "Allow the 'subject' to take one '50/50 hint' for the entire round"
                ]
            },
            {
                "number": 2,
                "title": "Verification of Answers: A Reward for Attentiveness",
                "content": "The 'agent' reveals the correct answers. For each match, the 'subject' receives a pre-agreed prize.",
                "ideas": [
                    "Prizes can be simple and sweet: a kiss, a shoulder massage, your favourite candy, the right to choose tomorrow's film",
                    "You can keep score on a board to add excitement"
                ]
            },
            {
                "number": 3,
                "title": "Role Reversal: The Return Move",
                "content": "Now the 'subject' becomes the 'agent' and conducts their own round of 'interrogation'. The task is to win back or strengthen the lead in the score.",
                "ideas": [
                    "Try to catch your partner out with a question that they definitely should know but may have forgotten",
                    "Add one joke question that has no correct answer"
                ]
            },
            {
                "number": 4,
                "title": "Final Chord: Summing Up",
                "content": "After two rounds, discuss the results. Which answers surprised you? What new things did you learn? Which questions were the most difficult?",
                "ideas": [
                    "Write down the funniest and most unexpected answers of the evening. This 'chronicle' will become your secret memory capsule"
                ]
            }
        ]
    },
    "dancefloorfortwo": {
        "heroEmoji": "🪩",
        "title": "Dance Floor for Two - Date Plan",
        "subtitle": "Date Plan",
        "heroTitle": "Dance Floor for Two",
        "heroSubtitle": "Music is the fastest way to change your mood, and dance is the most sincere way to talk without words. Turn your living room into a private dance club",
        "sectionTitle": "Process: \"Rhythms of Our Evening\"",
        "checklist": [
            {
                "title": "Playlist",
                "items": [
                    "Gather tracks of different genres in advance—from slow ballads to fiery funk or rock 'n' roll"
                ]
            },
            {
                "title": "Dance Floor",
                "items": [
                    "Clear some space in the room by moving the furniture aside"
                ]
            },
            {
                "title": "Atmosphere",
                "items": [
                    "Dim the lights",
                    "turn on fairy lights, a disco ball or just candles to set the mood"
                ]
            }
        ],
        "dresscode": [
            {
                "emoji": "👟",
                "title": "Freedom of Movement",
                "description": "Comfortable sports trousers and T-shirts"
            },
            {
                "emoji": "👗",
                "title": "Ball at the Palace",
                "description": "Dress up in your most beautiful clothes, even if they contrast with the surroundings"
            },
            {
                "emoji": "🦄",
                "title": "Pyjama Disco",
                "description": "Funny pyjamas or kigurumi for maximum relaxation"
            }
        ],
        "topics": {
            "show": false
        },
        "steps": [
            {
                "number": 1,
                "title": "Warm-up: The First Dance",
                "content": "Start with something slow and calm. This will help you tune in to each other, feel the rhythm and connect. Don't think about the movements, just hug each other and sway to the music.",
                "ideas": [
                    "Dance with your eyes closed to feel your partner better",
                    "Choose a song that you both have fond memories of"
                ]
            },
            {
                "number": 2,
                "title": "Dance Improvisation: A Game of Associations",
                "content": "To avoid awkward pauses, turn dancing into a game. Give each other funny tasks to perform in movement to the music.",
                "ideas": [
                    "Dance as if you were sneaking around",
                    "Dance as if you are looking for your other sock in the morning",
                    "Show us the dance of the winner who has just finished everything"
                ]
            },
            {
                "number": 3,
                "title": "Battle: Who Will Outdance Whom?",
                "content": "Put on the most energetic track and have a fun competition. The goal is not to win, but to make each other laugh and release energy.",
                "ideas": [
                    "Take turns showing one move that your partner must repeat and add their own to it",
                    "Try to synchronously repeat the moves from a famous music video"
                ]
            },
            {
                "number": 4,
                "title": "Final Chord: Our Special Dance",
                "content": "End the evening with a dance to the song that best describes your relationship. Let it become your unofficial 'couple's dance'.",
                "ideas": [
                    "Ask Siri or Google Assistant to 'remember this moment' and record video of the last 30 seconds of your dance"
                ]
            }
        ]
    },
    "fitnessfortwo": {
        "heroEmoji": "👟",
        "title": "Fitness for Two - Date Plan",
        "subtitle": "Date Plan",
        "heroTitle": "Fitness for Two",
        "heroSubtitle": "Training together is about support, synchronisation and team spirit. Turn sport into a fun game where you cheer each other on and recharge your batteries",
        "sectionTitle": "Process: \"In the Same Rhythm\"",
        "checklist": [
            {
                "title": "Equipment",
                "items": [
                    "Yoga mats or just a soft carpet",
                    "water bottles",
                    "towels"
                ]
            },
            {
                "title": "Music",
                "items": [
                    "Put together a playlist with the most energetic and motivating tracks"
                ]
            },
            {
                "title": "Space",
                "items": [
                    "Make sure you have enough room to move around"
                ]
            }
        ],
        "dresscode": [
            {
                "emoji": "👕",
                "title": "Dream Team",
                "description": "Sportswear in the same colour scheme or matching T-shirts"
            },
            {
                "emoji": "🏅",
                "title": "Olympic Reserve",
                "description": "The brightest and most fun sports outfits possible"
            },
            {
                "emoji": "🧘",
                "title": "Zen Masters",
                "description": "Comfortable leggings, shorts and tops for yoga or stretching"
            }
        ],
        "topics": {
            "show": false
        },
        "steps": [
            {
                "number": 1,
                "title": "Warm-up: Getting Ready to Start",
                "content": "Start with a light 5-minute warm-up to prepare your muscles. Simple swings, bends, joint rotations. Do this in sync, looking at each other.",
                "ideas": [
                    "Turn your warm-up into a game of 'Follow Me'",
                    "Set a timer and change exercises every 30 seconds"
                ]
            },
            {
                "number": 2,
                "title": "Main Set: Partner Work",
                "content": "Move on to exercises that require interaction. This develops trust and a sense of partnership.",
                "ideas": [
                    "Squats while holding hands: stand facing each other and squat simultaneously, creating a counterbalance",
                    "Push-ups with clapping: stand facing each other and clap your partner's palm after each push-up",
                    "Passing the ball: sit on the floor back to back and pass a ball or pillow to each other, twisting your torso"
                ]
            },
            {
                "number": 3,
                "title": "Competitive Spirit: Fun Challenges",
                "content": "Add an element of gambling. Organise several mini-competitions where the winner receives a symbolic prize.",
                "ideas": [
                    "Plank 'who can make whom laugh': stand in a plank position facing each other. The task is to hold the position, while the other's task is to make them laugh by any means necessary (except tickling)",
                    "'Chair' against the wall: whoever stays in this position the longest gets to choose the film for the evening"
                ]
            },
            {
                "number": 4,
                "title": "Final Chord: Cool Down and Relax",
                "content": "Finish your workout with some gentle stretching. This will help relax your muscles and smoothly transition from activity to rest.",
                "ideas": [
                    "Give each other a light shoulder or calf massage. Afterwards, prepare healthy smoothies and celebrate your 'victory' over laziness"
                ]
            }
        ]
    },
    "surprisebox": {
        "heroEmoji": "🎁",
        "title": "Surprise Box - Date Plan",
        "subtitle": "Date Plan",
        "heroTitle": "Surprise Box",
        "heroSubtitle": "The most valuable gifts don't have a price tag. Become secret magicians for each other, preparing inexpensive but meaningful items for your 'treasure box'",
        "sectionTitle": "Process: \"The Magic of Small Things\"",
        "checklist": [
            {
                "title": "Surprises",
                "items": [
                    "Each person secretly buys 3-4 small symbolic gifts for their partner in advance. The budget is minimal"
                ]
            },
            {
                "title": "Storage",
                "items": [
                    "Find a beautiful box or casket that will become your 'memory capsule'"
                ]
            },
            {
                "title": "Atmosphere",
                "items": [
                    "Create a festive mood with candles, garlands and light, pleasant music"
                ]
            }
        ],
        "dresscode": [
            {
                "emoji": "🎉",
                "title": "Birthday Boys and Girls",
                "description": "Wear party hats or funny headbands"
            },
            {
                "emoji": "🎁",
                "title": "Treasure Keepers",
                "description": "Cosy jumpers with pockets where you can hide surprises"
            },
            {
                "emoji": "✨",
                "title": "Wizards",
                "description": "Add something shiny or iridescent to your clothes"
            }
        ],
        "topics": {
            "show": true,
            "icon": "💝",
            "title": "Examples of Surprises",
            "items": [
                "Your partner's favourite chocolate bar, which is hard to find",
                "Funny socks with a print related to your shared joke",
                "A small Lego or Kinder Surprise figure that references their hobby",
                "Your favourite photo together, printed and framed",
                "A key ring that solves the problem of 'always losing your keys'"
            ]
        },
        "steps": [
            {
                "number": 1,
                "title": "The Moment of Surprise: Exchanging Gifts",
                "content": "Take turns picking out one gift at a time and giving it to your partner. Don't rush, enjoy the moment of unwrapping and the first reaction.",
                "ideas": [
                    "Wrap each gift in several layers of paper to prolong the intrigue",
                    "Before handing over the gift, give three funny clues about what's inside"
                ]
            },
            {
                "number": 2,
                "title": "The Story Behind an Item: Why This Particular Item?",
                "content": "After the gift is opened, the giver tells the story behind their choice. This is the most important part—not the item itself, but the thought behind it.",
                "ideas": [
                    "'I chose this because I remember how you laughed when we saw it last time'",
                    "'This item reminds me of your superpower...'"
                ]
            },
            {
                "number": 3,
                "title": "Final Chord: Creating a 'Memory Capsule'",
                "content": "When all the surprises have been given and the stories told, solemnly place all the items in your shared box. It becomes your personal museum.",
                "ideas": [
                    "Write the date of this evening on a small piece of paper and put it in the box with the gifts. Agree to add to it once a year or open it on special occasions"
                ]
            }
        ]
    },
    "videogamenight": {
        "heroEmoji": "🎮",
        "title": "Video Game Night - Date Plan",
        "subtitle": "Date Plan",
        "heroTitle": "Video Game Night",
        "heroSubtitle": "Video games are a portal to other worlds where you can go together. Become a well-coordinated team or fierce rivals in vivid emotions and laughter",
        "sectionTitle": "Process: \"Mission Possible\"",
        "checklist": [
            {
                "title": "Platform",
                "items": [
                    "Game console, PC, or even mobile phones with mobile games"
                ]
            },
            {
                "title": "Provisions",
                "items": [
                    "Snacks and drinks that can be eaten without taking your eyes off the screen (pizza, nachos, nuts)"
                ]
            },
            {
                "title": "Gaming Area",
                "items": [
                    "Comfortable sofa or armchairs",
                    "cushions",
                    "dim lighting so as not to distract from the screen"
                ]
            }
        ],
        "dresscode": [
            {
                "emoji": "🎮",
                "title": "Esports Players",
                "description": "Comfortable hoodies, caps, and gaming headphones"
            },
            {
                "emoji": "🦸",
                "title": "Fantasy Heroes",
                "description": "Cosy pyjamas or kigurumi costumes of your favourite characters"
            },
            {
                "emoji": "🛋️",
                "title": "Couch Troops",
                "description": "The most relaxed home clothes possible"
            }
        ],
        "topics": {
            "show": true,
            "icon": "🕹️",
            "title": "Examples of Games for Two",
            "items": [
                "Cooperative (team play): It Takes Two, Overcooked, Portal 2, A Way Out",
                "Competitive (friend vs. friend): racing (Mario Kart, Need for Speed), fighting (Mortal Kombat, Street Fighter)",
                "Fun and simple: any games from the Jackbox Games series, mobile Heads Up! or Draw Something"
            ]
        },
        "steps": [
            {
                "number": 1,
                "title": "Choosing the Arena: Team or Duel?",
                "content": "First, decide how you want to spend your evening. Will you work together to complete a challenging mission, or will you organise a tournament to find out who is today's 'couch champion'?",
                "ideas": [
                    "You can combine the two: start with a cooperative game to warm up, and finish with a competitive contest",
                    "If you are playing a competitive game, agree on a 'prize for the winner'"
                ]
            },
            {
                "number": 2,
                "title": "Start of the Tournament: The Game is On!",
                "content": "Immerse yourself in the game! Don't forget to communicate, coordinate your actions, cheer each other on or, conversely, tease your partner. Emotions are the main part of this date.",
                "ideas": [
                    "If you are playing a competitive game, organise a 'best of three' tournament. The loser of round compliments the winner",
                    "Come up with funny names for your team (e.g., 'Couch Crushers')"
                ]
            },
            {
                "number": 3,
                "title": "Final Chord: Hall of Fame",
                "content": "After the game is over, don't rush to turn off the console. Discuss the funniest and most tense moments. Who was the hero of the evening, and who was the most awkward player?",
                "ideas": [
                    "Take a victory selfie with your joysticks in front of the final credits or scoreboard. Create a separate folder on your phone called 'Our Hall of Fame'"
                ]
            }
        ]
    },
    "cleaninggame": {
        "heroEmoji": "🧼",
        "title": "Cleaning Game - Date Plan",
        "subtitle": "Date Plan",
        "heroTitle": "Cleaning Game",
        "heroSubtitle": "Turn the most boring routine into a fun competition. You're 'chaos fighters' and the reward will be cleanliness and a great mood",
        "sectionTitle": "Process: \"Operation Clean House\"",
        "checklist": [
            {
                "title": "Arsenal",
                "items": [
                    "Rags, sponges, detergents, mop, vacuum cleaner, rubbish bags"
                ]
            },
            {
                "title": "Timer",
                "items": [
                    "Phone with a stopwatch or kitchen timer"
                ]
            },
            {
                "title": "Soundtrack",
                "items": [
                    "Make a playlist in advance with the most upbeat and rhythmic music"
                ]
            }
        ],
        "dresscode": [
            {
                "emoji": "🪖",
                "title": "Cleaning Special Forces",
                "description": "Comfortable dark clothing, bandanas on your head"
            },
            {
                "emoji": "👻",
                "title": "Dust Hunters",
                "description": "Old T-shirts and shorts that you don't mind getting dirty"
            },
            {
                "emoji": "🧚",
                "title": "Cleanliness Fairies",
                "description": "Something light, bright and funny"
            }
        ],
        "topics": {
            "show": false
        },
        "steps": [
            {
                "number": 1,
                "title": "Division of Territories: Plan of Attack",
                "content": "Examine the 'battlefield' and assign areas of responsibility. You can draw lots to decide who gets the kitchen and who gets the bedroom. Or you can work in the same area but perform different tasks.",
                "ideas": [
                    "Organise a 'relay race': every 15 minutes, when the timer goes off, switch tasks or rooms",
                    "Divide responsibilities: one person is responsible for 'dry' cleaning (dusting, vacuuming), the other is responsible for 'wet' cleaning (washing floors and surfaces)"
                ]
            },
            {
                "number": 2,
                "title": "Fighting Chaos: Fun Challenges",
                "content": "Add some game elements to the process. This will turn the routine into a competition and help you move faster.",
                "ideas": [
                    "Speed cleaning: who can sort through the pile of things on the chair faster? The winner gets the title of 'Master of Order'",
                    "Treasure hunt: who can find the most long-lost items (coins, hair clips, lost socks) while tidying up?",
                    "Musical freeze frame: cleaning continues while the music plays. As soon as the track stops, everyone must freeze in a funny pose"
                ]
            },
            {
                "number": 3,
                "title": "Final Chord: Reward for Your Efforts",
                "content": "When the last bag of rubbish has been taken out and the rags have been washed, hold a solemn 'work acceptance' ceremony. Walk around the flat, praising each other for the work you have done.",
                "ideas": [
                    "Order pizza or sushi and have dinner right on the floor in a perfectly clean room. The winner of all challenges is officially exempt from washing the dishes"
                ]
            }
        ]
    },
    "homespa": {
        "heroEmoji": "🛁",
        "title": "Home SPA - Date Plan",
        "subtitle": "Date Plan",
        "heroTitle": "Home SPA",
        "heroSubtitle": "Turn your bathroom and bedroom into an oasis of calm and care. Become masters of relaxation for each other through simple rituals",
        "sectionTitle": "Process: \"Oasis for Two\"",
        "checklist": [
            {
                "title": "Arsenal",
                "items": [
                    "Fabric face masks, scrubs, aromatic oils or massage cream, bath salts or foam"
                ]
            },
            {
                "title": "Accessories",
                "items": [
                    "Soft towels and bathrobes",
                    "scented candles",
                    "sticks or a diffuser"
                ]
            },
            {
                "title": "Atmosphere",
                "items": [
                    "Dim lighting",
                    "a playlist with calm music (ambient, nature sounds, lounge)"
                ]
            }
        ],
        "dresscode": [
            {
                "emoji": "🧖",
                "title": "Guardians of Relaxation",
                "description": "Soft bathrobes and fluffy slippers"
            },
            {
                "emoji": "☮️",
                "title": "Zen Adepts",
                "description": "Comfortable pyjamas made from natural fabrics"
            },
            {
                "emoji": "💧",
                "title": "Lords of the Elements",
                "description": "Light shorts and T-shirts"
            }
        ],
        "topics": {
            "show": false
        },
        "steps": [
            {
                "number": 1,
                "title": "Cleansing Ritual: Facial Care",
                "content": "Start with simple and pleasant facial treatments. This will put you in the mood for relaxation.",
                "ideas": [
                    "Help each other apply clay or fabric masks. Doing this together is great fun!",
                    "Make a steam bath for your face by adding a few drops of eucalyptus or lavender essential oil to hot water"
                ]
            },
            {
                "number": 2,
                "title": "The Art of Touch: Massage Time",
                "content": "Move to the bedroom. Take turns giving each other a light, relaxing massage. You don't need to be a professional; the main thing is to be gentle and attentive.",
                "ideas": [
                    "Shoulder and neck massage: this is a universal way to relieve tension after a day's work",
                    "Foot massage: an incredibly relaxing procedure, especially when using a nourishing cream",
                    "Hand massage: we often forget about our hands, but they get tired too"
                ]
            },
            {
                "number": 3,
                "title": "Full Immersion: A Bath for Two",
                "content": "Fill the bath with warm water, add sea salt, foam or a bath bomb. Light candles around the room and immerse yourself in an atmosphere of complete tranquillity.",
                "ideas": [
                    "Bring along some cool drinks and fruit, such as grapes or strawberries",
                    "Play an audiobook or simply lie in silence"
                ]
            },
            {
                "number": 4,
                "title": "Final Chord: A State of Weightlessness",
                "content": "After all the procedures, take your time to wrap yourself in warm robes or immediately get under the blanket. Allow yourself to just lie there without discussing anything.",
                "ideas": [
                    "End the evening with a cup of herbal tea with honey. Try lying in silence for 10 minutes, just holding hands and feeling each other's presence"
                ]
            }
        ]
    },
    "ourlittlegarden": {
        "heroEmoji": "🪴",
        "title": "Our Little Garden - Date Plan",
        "subtitle": "Date Plan",
        "heroTitle": "Our Little Garden",
        "heroSubtitle": "Creating something alive together is a little bit of magic. 'Adopt' a houseplant that will become a silent witness and symbol of your relationship",
        "sectionTitle": "Process: \"Birth of a Symbol\"",
        "checklist": [
            {
                "title": "Main Character",
                "items": [
                    "Choose an undemanding plant together at the shop (zamioculcas, sansevieria or chlorophytum)"
                ]
            },
            {
                "title": "Tools",
                "items": [
                    "A nice pot or planter",
                    "soil",
                    "drainage (expanded clay)",
                    "gloves",
                    "a scoop"
                ]
            },
            {
                "title": "Workspace",
                "items": [
                    "Cover the floor with newspapers or plastic sheeting so you don't have to worry about making a mess"
                ]
            },
            {
                "title": "Atmosphere",
                "items": [
                    "Light and bright music (indie folk, acoustic covers)",
                    "daylight"
                ]
            }
        ],
        "dresscode": [
            {
                "emoji": "🌱",
                "title": "Gardeners",
                "description": "Old jeans and plaid shirts"
            },
            {
                "emoji": "🌿",
                "title": "Nature Guardians",
                "description": "Green or earth-toned clothing"
            },
            {
                "emoji": "🧑‍🌾",
                "title": "Experimental Florists",
                "description": "Comfortable overalls or aprons"
            }
        ],
        "topics": {
            "show": false
        },
        "steps": [
            {
                "number": 1,
                "title": "Transplanting: Giving a New Resident a Home",
                "content": "Prepare the pot together: pour drainage material into the bottom, then add a layer of soil. Carefully remove the plant from the transport pot and place it in the new one, covering it with soil.",
                "ideas": [
                    "Turn it into a ritual: one person holds the plant, the other carefully works with a trowel",
                    "You can place a 'time capsule' at the bottom of the pot before adding soil—a coin or a note with the date and your wishes"
                ]
            },
            {
                "number": 2,
                "title": "Art Workshop: Decorating the Pot",
                "content": "If you have chosen a simple ceramic or plastic pot, turn it into an art object.",
                "ideas": [
                    "Paint the pot with acrylic paints: draw patterns, funny faces or your initials",
                    "Write the name you have chosen for the plant on it",
                    "Decorate it with decorative elements or simply tie a pretty ribbon around it"
                ]
            },
            {
                "number": 3,
                "title": "Making a Schedule: A Care Plan",
                "content": "Your 'pet' needs care. Discuss and decide who will water, spray and feed it, and when.",
                "ideas": [
                    "Come up with a name and personality for the plant. For example, 'Igor the Cactus, a little prickly, but kind at heart'",
                    "Hang a funny 'watering schedule' on the refrigerator so you don't forget"
                ]
            },
            {
                "number": 4,
                "title": "Final Touch: A Place of Honour",
                "content": "Find the best place in your home for your new green friend. Put it where it will be pleasing to the eye and remind you of that warm evening.",
                "ideas": [
                    "Take a 'family portrait'—the two of you and your new plant. Agree to take a photo with it every six months to see how you are all growing together"
                ]
            }
        ]
    },
    "rolereversal": {
        "heroEmoji": "👗",
        "title": "Role Reversal - Date Plan",
        "subtitle": "Date Plan",
        "heroTitle": "Role Reversal",
        "heroSubtitle": "Ever wondered what it would be like to spend an evening in your partner's shoes? A fun theatrical experiment where you swap clothes and habits",
        "sectionTitle": "Process: \"One Evening in Your Shoes\"",
        "checklist": [
            {
                "title": "Wardrobe",
                "items": [
                    "Each person prepares a complete set of their clothes for their partner in advance (from socks to a shirt or dress)"
                ]
            },
            {
                "title": "Setting",
                "items": [
                    "You will need a large mirror and a phone for photos and videos"
                ]
            },
            {
                "title": "Atmosphere",
                "items": [
                    "Put on a fun and dynamic playlist that puts you in the mood for silliness"
                ]
            }
        ],
        "dresscode": [
            {
                "emoji": "👔",
                "title": "Partner's Choice",
                "description": "On this date, your partner decides the dress code! Be prepared for anything"
            }
        ],
        "topics": {
            "show": false
        },
        "steps": [
            {
                "number": 1,
                "title": "Transformation: A Reverse Fashion Show",
                "content": "The funniest moment is getting dressed. Help each other cope with unfamiliar clothes. When the looks are ready, organise a funny fashion show to music, walk around the room with your partner's 'signature' gait.",
                "ideas": [
                    "Take a series of 'before' and 'after' photos",
                    "Shoot a short video of yourselves posing in your new outfits"
                ]
            },
            {
                "number": 2,
                "title": "Immerse Yourself in the Look: An Evening in a New Role",
                "content": "Spend at least an hour wearing each other's clothes. Try doing your usual activities: making tea, scrolling through your phone, watching TV, but in your new look.",
                "ideas": [
                    "Try sitting on the sofa or in an armchair in your partner's favourite position",
                    "Talk on the phone with an imaginary interlocutor, using their typical phrases and intonations"
                ]
            },
            {
                "number": 3,
                "title": "One-Person Theatre: Parodying Habits",
                "content": "This is the highlight of the evening. Take turns showing each other friendly parodies of characteristic gestures, facial expressions or phrases. The main thing is to do it in a friendly manner.",
                "ideas": [
                    "'What you look like when you're concentrating on your work'",
                    "'Your face when you see a cute cat'",
                    "'Your favourite phrase when you don't want to wash the dishes'"
                ]
            },
            {
                "number": 4,
                "title": "Final Chord: Returning to Yourself",
                "content": "After the game, change back into your own clothes and discuss your impressions. It wasn't just a masquerade, but an interesting experience.",
                "ideas": [
                    "Share one discovery you made about your partner or yourself. For example: 'I never thought your jeans would be so comfortable!'"
                ]
            }
        ]
    },
    "boardgamenight": {
        "heroEmoji": "🎲",
        "title": "Board Game Night - Date Plan",
        "subtitle": "Date Plan",
        "heroTitle": "Board Game Night",
        "heroSubtitle": "Board games are a ready-made universe in a box, full of excitement, strategy and unexpected twists. Your personal gaming marathon",
        "sectionTitle": "The Process: \"Let the Game Begin!\"",
        "checklist": [
            {
                "title": "Game Library",
                "items": [
                    "Choose 2-3 different types of board games in advance"
                ]
            },
            {
                "title": "Snacks",
                "items": [
                    "Prepare a 'game table' with drinks and food that is easy to eat with your hands (nuts, crisps, sliced fruit, mini pizzas)"
                ]
            },
            {
                "title": "Atmosphere",
                "items": [
                    "A comfortable place at the table or on the floor",
                    "dim warm lighting",
                    "background music that does not interfere with thinking"
                ]
            }
        ],
        "dresscode": [
            {
                "emoji": "♟️",
                "title": "Grandmasters",
                "description": "Cosy robes or kigurumi"
            },
            {
                "emoji": "🎲",
                "title": "Lords of the Dice",
                "description": "Comfortable tracksuits or pyjamas"
            },
            {
                "emoji": "🎩",
                "title": "Bluff Masters",
                "description": "Loungewear, but with one 'serious' element, such as a hat or bow tie"
            }
        ],
        "topics": {
            "show": true,
            "icon": "🃏",
            "title": "Examples of Games for Two",
            "items": [
                "Strategy games: Carcassonne, 7 Wonders: Duel, Patchwork, Hive",
                "Fun and fast: Uno, Dobble, Equivoke for Two, Code Names: Duet",
                "Classics: chess, checkers, backgammon"
            ]
        },
        "steps": [
            {
                "number": 1,
                "title": "Choosing Your Weapons: Deciding on the Evening's Arsenal",
                "content": "Lay out all the prepared games and decide which one to start with. It is better to move from simpler and faster games to more complex and longer ones, or vice versa—start with the main 'dish' while you still have the energy.",
                "ideas": [
                    "Hold a draw to choose the first game",
                    "Agree that the loser of one game chooses the next"
                ]
            },
            {
                "number": 2,
                "title": "The Start of the Tournament: A Battle of Wits and Luck",
                "content": "Immerse yourself in the game! Explain the rules if anyone has forgotten them and start the game. Don't forget to joke around, comment on moves and create friendly competition.",
                "ideas": [
                    "Organise a tournament with up to three wins. The winner receives a humorous title, such as 'King of Carcassonne'",
                    "Introduce a rule: before each turn, players must compliment their partner"
                ]
            },
            {
                "number": 3,
                "title": "Final Chord: Honouring the Winners",
                "content": "After the last game, sum up the results. It doesn't matter who won on points—on an evening like this, both sides are winners.",
                "ideas": [
                    "Create a 'challenge cup'—it can be any funny thing in your house (a statuette, a mug, a soft toy). The winner keeps it until the next board game night"
                ]
            }
        ]
    },
    "cookingbattle": {
        "heroEmoji": "🍴",
        "title": "Cooking Battle - Date Plan",
        "subtitle": "Date Plan",
        "heroTitle": "Cooking Battle",
        "heroSubtitle": "For one evening, your kitchen will be transformed into the set of an exciting cooking show. This is not just dinner, but a friendly duel where the main prize is laughter, creative chaos, and a deliciously tasty result",
        "sectionTitle": "The Process: \"May the Tastiest Win!\"",
        "checklist": [
            {
                "title": "Battle Theme",
                "items": [
                    "Choose a general direction in advance (e.g., Italian dinner, everything from avocado, or the best burger)"
                ]
            },
            {
                "title": "Shopping & Arena",
                "items": [
                    "Go to the shop together and choose ingredients for two different but thematically related dishes",
                    "prepare kitchen tools and divide the workspace"
                ]
            },
            {
                "title": "The Vibe",
                "items": [
                    "Bright lights",
                    "energetic playlist (funk, disco, rock 'n' roll) to keep up the pace"
                ]
            }
        ],
        "dresscode": [
            {
                "emoji": "👨‍🍳",
                "title": "Chefs",
                "description": "Matching aprons and, perhaps, chef's hats for fun"
            },
            {
                "emoji": "🎤",
                "title": "Kitchen Reporters",
                "description": "Comfortable clothing and a fighting spirit"
            }
        ],
        "topics": {
            "show": false
        },
        "steps": [
            {
                "number": 1,
                "title": "Start of the Battle: Choosing Your Weapon",
                "content": "At the signal (for example, the first chord of the evening's theme song), everyone begins to prepare their dish. You may comment on each other's actions, but not help. The intrigue must remain!",
                "ideas": [
                    "Set a timer for 45 minutes to add excitement",
                    "Introduce a \"secret ingredient\" rule: halfway through, exchange one unexpected ingredient (e.g., chocolate or cinnamon) that must be incorporated into the dish"
                ]
            },
            {
                "number": 2,
                "title": "Cooking Show: Improvisation in the Kitchen",
                "content": "Immerse yourselves in the role of TV show participants. Add dramatic commentary to your actions, conduct humorous interviews with each other, and don't be afraid of mistakes—they only add to the fun.",
                "ideas": [
                    "Comment on the process like a sports commentator: \"And he's doing a masterful chop on the onion! What technique!\"",
                    "Come up with and use your \"chef's\" signature phrases"
                ]
            },
            {
                "number": 3,
                "title": "Judgement Day: Tasting and Verdict",
                "content": "When both dishes are ready, set the table beautifully. Hold a formal presentation: each person presents their masterpiece, describing its taste and \"concept.\" Then taste and deliver your verdict.",
                "ideas": [
                    "Pretend to be strict restaurant critics, putting on a smart face and writing something in a notebook",
                    "Give scores in three categories: taste, presentation and creativity"
                ]
            },
            {
                "number": 4,
                "title": "Final Chord: Winners' Banquet",
                "content": "Regardless of the scores, declare a friendly draw. After all, everyone wins in this competition. Enjoy the amazing dinner you have created together.",
                "ideas": [
                    "The winner receives the honorary title of \"King of the Kitchen\" until the next battle",
                    "The loser is ceremoniously exempted from washing the dishes"
                ]
            }
        ]
    },
    "melodyfortwo": {
        "heroEmoji": "🎤",
        "title": "Melody for Two - Date Plan",
        "subtitle": "Date Plan",
        "heroTitle": "Karaoke for Two",
        "heroSubtitle": "Some feelings are too big to speak, so we sing them. This date isn't about hitting the perfect notes; it's about harmonies, laughter, and belting out your favorite ballads together in the comfort of your own home.",
        "sectionTitle": "The Process: \"Living Room Concert\"",
        "checklist": [
            {
                "title": "Stage Gear",
                "items": [
                    "A screen for lyrics (TV, Laptop, or Tablet)",
                    "Microphones (real ones or hairbrushes work equally well)",
                    "Good speakers"
                ]
            },
            {
                "title": "Rider",
                "items": [
                    "Water or tea to soothe the vocal cords",
                    "Your favourite cocktails or mocktails for 'liquid courage'"
                ]
            },
            {
                "title": "The Vibe",
                "items": [
                    "Dim lighting or disco ball effects",
                    "A clear space to dance and perform",
                    "Pillows for the 'audience' section"
                ]
            }
        ],
        "dresscode": [
            {
                "emoji": "😎",
                "title": "Pop Stars",
                "description": "Flashy outfits, sunglasses indoors, or sequins"
            },
            {
                "emoji": "🧢",
                "title": "Backstage Casual",
                "description": "Comfy sweatpants and hoodies for a rehearsal vibe"
            }
        ],
        "topics": {
            "show": true,
            "icon": "🎶",
            "title": "Setlist Categories",
            "items": [
                "\"The Power Ballad\": A song to belt out with maximum dramatic emotion",
                "\"The Classic Duet\": A cheesy love song meant for two voices",
                "\"Guilty Pleasure\": The embarrassing song you both know every word to",
                "\"The Serenade\": Pick a song to sing specifically to your partner",
                "\"Teenage Angst\": A track you listened to on repeat when you were 15",
                "\"The Rap God\": A fast-paced lyrical challenge to test your tongue-twisting skills",
                "\"Gender Bender\": You sing a song by a female artist, they sing one by a male artist",
                "\"Showtime\": A Disney or Broadway hit that requires full theatrical acting"
            ]
        },
        "steps": [
            {
                "number": 1,
                "title": "Soundcheck: Setting the Stage",
                "content": "Prepare your 'venue.' Connect your device to the TV or speakers to display lyrics (YouTube or Spotify Karaoke mode work great). Do a quick vocal warm-up together to break the ice.",
                "ideas": [
                    "Do silly lip-trills or hums to warm up",
                    "Designate a specific rug or spot as 'The Stage'",
                    "Pour your drinks before the show starts"
                ]
            },
            {
                "number": 2,
                "title": "The Main Event: Belting It Out",
                "content": "Take turns picking songs from the setlist categories. Whether you are singing in perfect harmony or shouting the chorus off-key, the goal is total commitment to the performance.",
                "ideas": [
                    "Rate each other's performance with kisses instead of points",
                    "Try to include choreography for the upbeat songs"
                ]
            },
            {
                "number": 3,
                "title": "The Challenge: Switch It Up",
                "content": "Now that you are warmed up, try a challenge. Pick a song for your partner that they wouldn't normally choose, or try to sing a rap song in an operatic style. Let the laughter take over.",
                "ideas": [
                    "Record a video of the funniest performance to watch later",
                    "Try to sing a whole song while holding eye contact"
                ]
            },
            {
                "number": 4,
                "title": "Acoustic Set: The Cool Down",
                "content": "End the concert with a slow, gentle song. You don't even have to sing loud—just hum along softly while slow dancing or sitting close together on the 'stage.'",
                "ideas": [
                    "Change the lyrics of a famous song to be about your relationship",
                    "Thank your 'audience' of one for a great night"
                ]
            }
        ]
    },
    "messagetomorrow": {
        "heroEmoji": "⌛",
        "title": "A Message to Yourself Tomorrow - Date Plan",
        "subtitle": "Date Plan",
        "heroTitle": "A Message to Yourself Tomorrow",
        "heroSubtitle": "Create a real time capsule—a parcel to yourselves in the future. Open it years later like finding a treasure that reminds you of how it all began",
        "sectionTitle": "Process: \"Bookmark in Time\"",
        "checklist": [
            {
                "title": "Container",
                "items": [
                    "A beautiful box, a tin biscuit tin, a bottle with a wide neck"
                ]
            },
            {
                "title": "Artefacts",
                "items": [
                    "Paper and pens, small items that are meaningful to you"
                ]
            },
            {
                "title": "Atmosphere",
                "items": [
                    "Dim candlelight, calm nostalgic music"
                ]
            }
        ],
        "dresscode": [
            {
                "emoji": "⏳",
                "title": "Guardians of Time",
                "description": "Cosy, simple clothes that are comfortable for thinking and writing"
            },
            {
                "emoji": "💭",
                "title": "Dreamers",
                "description": "Soft pyjamas and warm socks"
            }
        ],
        "topics": {
            "show": false
        },
        "steps": [
            {
                "number": 1,
                "title": "Collecting Artefacts: Evidence of the Present",
                "content": "Start by collecting 'material evidence' of your current life. Each person chooses 2-3 small items that symbolise something important to them right now.",
                "ideas": [
                    "A cinema ticket from a recent date",
                    "A printed funny selfie",
                    "A dried flower or leaf from the park where you went for a walk",
                    "A cork from a bottle of wine drunk on a special occasion"
                ]
            },
            {
                "number": 2,
                "title": "Letters to the Future: A Conversation with Yourself",
                "content": "Each of you writes two short letters: one to your future self, the other to your future partner. Don't try to be prophets; write about how you feel now.",
                "ideas": [
                    "To yourself: 'I hope you still laugh at the same jokes. Don't forget how important...'",
                    "To your partner: 'Right now, I love how you... I hope we've kept that.'"
                ]
            },
            {
                "number": 3,
                "title": "Sealing Ritual: Creating a Secret",
                "content": "When all the artefacts and letters have been collected, carefully place them in the container. Do this solemnly. Close the lid tightly and write the date when the capsule can be opened on it.",
                "ideas": [
                    "'Open on the 5th wedding anniversary'",
                    "'Open in 3 years, 1 month and 1 day'",
                    "'Open when we buy our house'"
                ]
            },
            {
                "number": 4,
                "title": "Final Chord: Choosing a Keeper",
                "content": "Hide the capsule in a safe place where it won't be found before its time. Let it be a far corner of a wardrobe, a mezzanine or even a box with documents.",
                "ideas": [
                    "Take a photo of the moment you hide the capsule and set a reminder in your calendar for the chosen date. The photo will become the 'key' to remembering this evening"
                ]
            }
        ]
    },
    "alchemyfortwo": {
        "heroEmoji": "🍸",
        "title": "Alchemy for Two - Date Plan",
        "subtitle": "Date Plan",
        "heroTitle": "Alchemy for Two",
        "heroSubtitle": "For one evening, your kitchen will be transformed into a stylish speakeasy bar, where you are the only guests and the chief mixologists. You will be mixing not just drinks, but moods, creating unique \"elixirs\"",
        "sectionTitle": "The Process: \"On the Other Side of the Bar\"",
        "checklist": [
            {
                "title": "Bar",
                "items": [
                    "Shaker (or tightly sealed jar)",
                    "measuring cup",
                    "beautiful glasses",
                    "ice"
                ]
            },
            {
                "title": "Ingredients",
                "items": [
                    "Juices, tonics, syrups",
                    "fresh fruit and herbs (lime, mint, rosemary)",
                    "alcoholic base if desired"
                ]
            },
            {
                "title": "The Vibe",
                "items": [
                    "Dim the main lights, leaving only local lighting",
                    "play jazz or lounge music"
                ]
            }
        ],
        "dresscode": [
            {
                "emoji": "🥂",
                "title": "The Great Gatsby",
                "description": "Add a shiny accessory to your home look"
            },
            {
                "emoji": "🖤",
                "title": "Secret Bar",
                "description": "Elegant clothing in dark colours"
            },
            {
                "emoji": "🌴",
                "title": "Tropical Fiesta",
                "description": "Bright shirts and dresses"
            }
        ],
        "topics": {
            "show": true,
            "icon": "🍸",
            "title": "Cocktail Examples",
            "items": [
                "Classics: Gin and tonic, mojito, negroni, whisky sour",
                "Movie cocktails: White Russian (The Big Lebowski), Vesper (James Bond)",
                "Non-alcoholic: Shirley Temple, signature lemonade with basil and strawberries"
            ]
        },
        "steps": [
            {
                "number": 1,
                "title": "Bartending School: Following the Classics",
                "content": "Start with the basics. Choose one classic cocktail, find a video recipe and try to make it strictly according to the instructions. Feel like students, paying attention to the details: how to mix correctly, how to chill the glass.",
                "ideas": [
                    "First, one person makes a cocktail for two, then the second person makes the same cocktail. Compare whose is closer to perfection",
                    "Have a competition for the most beautiful glass decoration"
                ]
            },
            {
                "number": 2,
                "title": "Creative Round: Secret Ingredient",
                "content": "Now break the rules. Take the same classic recipe and add a twist—an ingredient that shouldn't be there (a drop of hot sauce, a sprig of thyme, mango puree). Hold a blind tasting and try to guess your partner's secret addition.",
                "ideas": [
                    "Discuss how the taste has changed. Has it improved or just become strange?",
                    "Come up with a name for your new version of the cocktail"
                ]
            },
            {
                "number": 3,
                "title": "Battle of the Mixologists: Birth of a Legend",
                "content": "Complete creative freedom! Using any ingredients available, each of you creates your own original cocktail from scratch. The main condition is that the drink must have a name and a story related to your couple.",
                "ideas": [
                    "\"That Very Evening in June\": sweet, berry-flavoured, with a slight sourness",
                    "\"Smile After a Quarrel\": tart at first, but with a warm aftertaste"
                ]
            },
            {
                "number": 4,
                "title": "Final Chord: Tasting the Masterpiece",
                "content": "Organise a festive presentation of your original drinks. Tell the story and explain your choice of ingredients. Taste them and choose whose cocktail will become the \"signature drink\" of your home bar.",
                "ideas": [
                    "Write down the recipe for the winning cocktail (or both) on a nice card and hang it on the refrigerator",
                    "Repeat it on special occasions"
                ]
            }
        ]
    },
    "cosybookclub": {
        "heroEmoji": "🫖",
        "title": "Cosy Book Club - Date Plan",
        "subtitle": "Date Plan",
        "heroTitle": "Cosy Book Club",
        "heroSubtitle": "Reading a book is a personal journey, but discussing what you've read is a shared adventure. This date is your exclusive book club for two—an evening of deep conversation, unexpected interpretations and cosiness",
        "sectionTitle": "The Process: \"Between the Lines\"",
        "checklist": [
            {
                "title": "Main Character",
                "items": [
                    "The same book, read in advance by both of you"
                ]
            },
            {
                "title": "Club Menu",
                "items": [
                    "Fragrant tea, cocoa, coffee or wine",
                    "cheese platter, biscuits, chocolate"
                ]
            },
            {
                "title": "The Vibe",
                "items": [
                    "Maximum comfort—blankets, pillows",
                    "dim candlelight",
                    "calm instrumental music or the sound of a fireplace"
                ]
            }
        ],
        "dresscode": [
            {
                "emoji": "📚",
                "title": "Library Chic",
                "description": "Cosy knitted jumpers, woollen socks and, perhaps, glasses"
            },
            {
                "emoji": "📖",
                "title": "Characters from a Novel",
                "description": "Dress in the style of the characters or era described in the book"
            }
        ],
        "topics": {
            "show": true,
            "icon": "📕",
            "title": "Book Suggestions",
            "items": [
                "For romantics: The Great Gatsby (F. Scott Fitzgerald), The Little Prince (A. de Saint-Exupéry)",
                "For mystery lovers: And Then There Were None (A. Christie), Flowers for Algernon (D. Keyes)",
                "For dreamers: Fahrenheit 451 (Ray Bradbury), The Hitchhiker's Guide to the Galaxy (Douglas Adams)"
            ]
        },
        "steps": [
            {
                "number": 1,
                "title": "First Impression: A Storm of Emotions",
                "content": "Start with feelings, not analysis. Share the first thing that comes to mind after reading: \"That was brilliant!\", \"I didn't understand the ending\", \"I felt very sad\". This will set an honest tone for the whole conversation.",
                "ideas": [
                    "What impression did the book leave you with?",
                    "Did it live up to your expectations?"
                ]
            },
            {
                "number": 2,
                "title": "Characters as Mirrors: A Conversation About Us",
                "content": "Discuss the characters. Which ones did you like best, and which ones annoyed you? Whose actions do you understand, and whose don't you? Talking about fictional characters is a safe way to discuss your own values and views.",
                "ideas": [
                    "Did you recognise yourself or me in any of the characters?",
                    "What would you have done in the main character's place in the key scene?"
                ]
            },
            {
                "number": 3,
                "title": "Deep Dive: Main Idea",
                "content": "Now we can move on to the analysis. What do you think this book is really about? What is the main idea the author wanted to convey? It often happens that two people see completely different meanings in the same story.",
                "ideas": [
                    "If you had to describe this book in one word, what would you choose?",
                    "Has this book changed your perspective on anything?"
                ]
            },
            {
                "number": 4,
                "title": "Final Chord: Quote of the Evening",
                "content": "Each of you chooses one or two phrases from the book that resonated with you the most. Read them aloud and explain why you chose them. This is the most personal and touching way to end the discussion.",
                "ideas": [
                    "Write both quotes on a beautiful card and use it as a bookmark",
                    "Set aside a separate place on the shelf for \"our club's books\" that you read together"
                ]
            }
        ]
    },
    "duelofminds": {
        "heroEmoji": "🔎",
        "title": "Duel of Minds: Two Quests, Two Secrets - Date Plan",
        "subtitle": "Date Plan",
        "heroTitle": "Duel of Minds: Two Quests, Two Secrets",
        "heroSubtitle": "For one evening, your flat will turn into a treasure chest, and you will become brilliant quest masters for each other. Each of you secretly prepares a chain of riddles for your partner, leading to a hidden prize",
        "sectionTitle": "The Process: \"Treasure Hunt\"",
        "checklist": [
            {
                "title": "Treasure",
                "items": [
                    "Choose a small but meaningful prize for your partner (a book, a rare sweet treat, a \"massage certificate\", a funny mug)"
                ]
            },
            {
                "title": "Hiding Place",
                "items": [
                    "Hide the prize securely somewhere in the home"
                ]
            },
            {
                "title": "Map",
                "items": [
                    "Come up with 3-4 riddles, each leading to the next, and the last one to the hiding place"
                ]
            }
        ],
        "dresscode": [
            {
                "emoji": "🔍",
                "title": "Detectives",
                "description": "Comfortable clothes for searching high and low"
            },
            {
                "emoji": "🎭",
                "title": "Mysterious Masters",
                "description": "Add a mysterious accessory—a hat, a cape, or dramatic glasses"
            }
        ],
        "topics": {
            "show": true,
            "icon": "🗝️",
            "title": "Riddle Examples",
            "items": [
                "Association riddle: \"Look where the cold keeps memories of summer\" (freezer with frozen berries)",
                "Rebus: Draw a picture, cross out letters, add new ones to spell a location",
                "Caesar cipher: Write the clue word, shifting each letter forward by 1 in the alphabet",
                "QR code: Create a QR code that leads to a photo taken at the next clue location"
            ]
        },
        "steps": [
            {
                "number": 1,
                "title": "Round 1: Questmaster A, Player B",
                "content": "The first of you hands your partner the starting note with the words: \"The game has begun!\" The quest master observes, enjoys the process, and can give vague clues if the player gets stuck.",
                "ideas": [
                    "Play the soundtrack from Sherlock Holmes or Indiana Jones in the background",
                    "Film your partner's attempts to solve the most difficult puzzle"
                ]
            },
            {
                "number": 2,
                "title": "Round 2: Role Reversal",
                "content": "Now everything is repeated in reverse. The second partner gives their first clue. You will see how different your trains of thought can be, even if you live together.",
                "ideas": [
                    "Try completing the quest against the clock to add some excitement",
                    "Use your phone's torch to create an atmosphere of investigation"
                ]
            },
            {
                "number": 3,
                "title": "Final Chord: The Award Ceremony",
                "content": "When both treasures have been found, hold a formal award ceremony. Tell each other which riddle in your partner's quest you liked the most and which was the most difficult.",
                "ideas": [
                    "Save the notes with the riddles, put them in an envelope and sign it with the date",
                    "This will be a great artefact that will be fun to reread in a few years"
                ]
            }
        ]
    },
    "eveningofgratitude": {
        "heroEmoji": "🫙",
        "title": "Evening of Gratitude - Date Plan",
        "subtitle": "Date Plan",
        "heroTitle": "Evening of Gratitude",
        "heroSubtitle": "In the flow of everyday life, we often forget to appreciate what we have. This evening is a conscious pause to say \"thank you\" to each other, not for something big, but for the thousands of little things that make up your shared happiness",
        "sectionTitle": "The Process: \"Map of Our Love\"",
        "checklist": [
            {
                "title": "Artefacts",
                "items": [
                    "A nice empty jar or box (\"Gratitude Jar\")",
                    "paper for notes",
                    "pens"
                ]
            },
            {
                "title": "Refreshments",
                "items": [
                    "Prepare a dish or drink associated with a warm memory (e.g., the same tea you drank on your first date)"
                ]
            },
            {
                "title": "The Vibe",
                "items": [
                    "Only candles and dim lighting",
                    "all gadgets in airplane mode and out of sight"
                ]
            }
        ],
        "dresscode": [
            {
                "emoji": "🧣",
                "title": "Cosy Elegance",
                "description": "Soft sweaters, cashmere, comfortable trousers"
            },
            {
                "emoji": "💕",
                "title": "Like on a First Date",
                "description": "Try to recreate the outfits you wore on your first date"
            }
        ],
        "topics": {
            "show": true,
            "icon": "💝",
            "title": "Gratitude Topics",
            "items": [
                "\"The moment I felt incredibly proud of you...\"",
                "\"The cosiest morning we spent together...\"",
                "\"A trip for which I am especially grateful...\"",
                "\"The day I realised that we are a real team...\""
            ]
        },
        "steps": [
            {
                "number": 1,
                "title": "Five \"Thank Yous\" for the Week",
                "content": "Start small. Sit across from each other and take turns saying five specific things you are grateful for from the past week. This sets the right tone and teaches you to notice the care in everyday life.",
                "ideas": [
                    "\"Thank you for hugging me when I came home tired\"",
                    "\"Thank you for that funny joke during dinner\"",
                    "\"Thank you for taking out the rubbish without asking\""
                ]
            },
            {
                "number": 2,
                "title": "Gratitude Jar: An Archive of Joy",
                "content": "Now embark on a journey down memory lane. Take turns naming a topic and sharing the first thing that comes to mind. Briefly write down each memory on a piece of paper and drop it into the jar.",
                "ideas": [
                    "Use different coloured paper for different categories of memories",
                    "Include funny moments alongside the romantic ones"
                ]
            },
            {
                "number": 3,
                "title": "Letter to the Present",
                "content": "Take a nice piece of paper and write a short letter answering one question: \"Why am I happy to be with you at this particular time in our lives?\" Then exchange letters and read them—either to yourself or aloud.",
                "ideas": [
                    "Don't try to write a long letter. Sometimes a few sincere sentences mean more than an entire poem"
                ]
            },
            {
                "number": 4,
                "title": "Final Chord: Silence After Words",
                "content": "After reading the letters, don't rush to discuss anything right away. Just sit quietly for a few minutes, holding hands. Allow the warmth and tenderness that fills the room to sink in.",
                "ideas": [
                    "Put these letters in your \"Gratitude Jar\"—they will become its most precious treasures",
                    "Agree to reread the notes from the jar once a year to remind yourselves how much you have in common"
                ]
            }
        ]
    },
    "talentworkshop": {
        "heroEmoji": "✂️",
        "title": "Talent Workshop - Date Plan",
        "subtitle": "Date Plan",
        "heroTitle": "Talent Workshop",
        "heroSubtitle": "We are all creators at heart. This date is a chance to discover new talents in yourself and each other, even if they turn out to be small and a little silly. The main thing is the process: joint efforts, laughing at mistakes, and supporting each other",
        "sectionTitle": "The Process: \"From Student to Master\"",
        "checklist": [
            {
                "title": "Lesson",
                "items": [
                    "Choose a short (15-25 minutes) video lesson for beginners on YouTube"
                ]
            },
            {
                "title": "Equipment",
                "items": [
                    "Depends on the hobby you choose (see examples)"
                ]
            },
            {
                "title": "Workspace",
                "items": [
                    "A comfortable table with good lighting",
                    "cover with plastic wrap if necessary"
                ]
            }
        ],
        "dresscode": [
            {
                "emoji": "🎨",
                "title": "Creative Mess",
                "description": "Clothes that you don't mind getting dirty"
            },
            {
                "emoji": "👩‍🎨",
                "title": "Masters of Their Craft",
                "description": "Wear something associated with your chosen hobby (berets for painting, aprons for sculpting)"
            }
        ],
        "topics": {
            "show": true,
            "icon": "🛠️",
            "title": "Activity Examples",
            "items": [
                "Modelling with self-hardening clay: clay, sticks (or toothpicks), a glass of water",
                "Origami: square sheets of coloured paper",
                "Calligraphy: pen, ink, thick paper",
                "Simple crocheting: crochet hook, skein of yarn"
            ]
        },
        "steps": [
            {
                "number": 1,
                "title": "Training Class: First Step",
                "content": "Play the video tutorial and start repeating after the master. Pause the video after each step so you have time to follow along. Don't worry if you don't get it right away—that's the whole point.",
                "ideas": [
                    "Help each other if someone is having trouble. Giving hints, laughing together—that's what teamwork is all about",
                    "Appoint a \"leader\" who will be responsible for pressing pause at the right time"
                ]
            },
            {
                "number": 2,
                "title": "Pair Practice: Joint Project",
                "content": "Once you have mastered the basic movements, turn off the video and try to create something of your own. Let it be a small and simple project, but one that you have done on your own.",
                "ideas": [
                    "Modelling: mould a talisman figure for your pair (e.g., your \"totem\" animal)",
                    "Calligraphy: write your partner's name or your shared symbolic word beautifully",
                    "Origami: make as many identical figures as possible as quickly as you can"
                ]
            },
            {
                "number": 3,
                "title": "Exhibition of Achievements",
                "content": "When your masterpieces are ready, organise an impromptu exhibition. Place them in a prominent place, take photos and admire the result.",
                "ideas": [
                    "Come up with a fancy name for each exhibit, just like in a real gallery",
                    "Hold a mock award ceremony with the presentation of \"diplomas\""
                ]
            },
            {
                "number": 4,
                "title": "Final Chord: Initiation into Mastery",
                "content": "Even if your crafts turned out crooked and funny, they are priceless because they preserve the warmth of this evening.",
                "ideas": [
                    "Create a special place on the shelf—\"The shelf of our first attempts\"—and put your creations there",
                    "Over time, it can be replenished with new exhibits from other creative dates"
                ]
            }
        ]
    },
    "nostalgicairwaves": {
        "heroEmoji": "📼",
        "title": "Nostalgic Airwaves - Date Plan",
        "subtitle": "Date Plan",
        "heroTitle": "Nostalgic Airwaves",
        "heroSubtitle": "Get ready for a journey in a time machine fuelled by YouTube! This evening is a marathon of old commercials, music videos and TV jingles that will instantly transport you back to your childhood or youth",
        "sectionTitle": "The Process: \"Back to the Past—Our TV Marathon\"",
        "checklist": [
            {
                "title": "Screen",
                "items": [
                    "Television, laptop, or projector"
                ]
            },
            {
                "title": "Nostalgic Treats",
                "items": [
                    "Find sweets and drinks from the past or their modern equivalents (retro sodas, classic candy, childhood snacks)"
                ]
            },
            {
                "title": "Comfort",
                "items": [
                    "A sofa covered with cushions and blankets",
                    "dim lighting like in a cinema"
                ]
            }
        ],
        "dresscode": [
            {
                "emoji": "👖",
                "title": "90s Style",
                "description": "Denim jackets, bright leggings, printed T-shirts"
            },
            {
                "emoji": "✨",
                "title": "2000s Glamour",
                "description": "Anything that resembles the era of rhinestones and low-rise waistlines"
            }
        ],
        "topics": {
            "show": true,
            "icon": "📺",
            "title": "YouTube Search Examples",
            "items": [
                "Old advertisements from your childhood era",
                "MTV hits of the 90s or 2000s",
                "Classic music videos from your teenage years",
                "Old TV show intros and bumpers"
            ]
        },
        "steps": [
            {
                "number": 1,
                "title": "Warm-Up: An Ad from the Past",
                "content": "Start with old advertisements. They are short, funny, and instantly trigger memories. Watch compilations and compete to see who can remember the slogan first.",
                "ideas": [
                    "Discuss which advertisements seem the most ridiculous now and which seem the most ingenious",
                    "Try re-recording the commercial in a new way"
                ]
            },
            {
                "number": 2,
                "title": "Prime Time: Golden Hits of the Era",
                "content": "Move on to music. Take turns being the \"VJ\" and \"request\" a music video that was significant to you. After watching, share a story related to the song.",
                "ideas": [
                    "\"I danced to this song for the first time at a disco\"",
                    "\"I wore this cassette out listening to it\"",
                    "Try to repeat the funniest dance moves from the video"
                ]
            },
            {
                "number": 3,
                "title": "Night Air: Do You Remember?",
                "content": "Once you are fully immersed in the atmosphere, you can put the video on in the background. Start sharing stories that come to mind.",
                "ideas": [
                    "What is the most ridiculous fashion trend you have tried?",
                    "What item from your childhood was a real treasure to you?",
                    "What did you dream about when you were 15?"
                ]
            },
            {
                "number": 4,
                "title": "Final Chord: A Message to Your Past Self",
                "content": "To conclude the evening, answer one question: \"What one piece of advice would you give to your 15-year-old self?\"",
                "ideas": [
                    "Write down these two pieces of advice on a single sheet of paper",
                    "Not for the sake of feeling sorry for something, but to see how far you've come since then and how great it is that you are now walking it together"
                ]
            }
        ]
    },
    "gymnasticsformind": {
        "heroEmoji": ✍️",
        "title": "Gymnastics for the Mind - Date Plan",
        "subtitle": "Date Plan",
        "heroTitle": "Gymnastics for the Mind",
        "heroSubtitle": "Train your most important muscle—your brain! Turn your living room into an elite club of experts with puzzles, friendly competition, and the joy of finding solutions",
        "sectionTitle": "Process: \"Intellectual Marathon\"",
        "checklist": [
            {
                "title": "Playing Field",
                "items": [
                    "A collection of crossword puzzles, sudoku, rebuses, or websites with logic puzzles and brain teasers"
                ]
            },
            {
                "title": "Tools",
                "items": [
                    "Pens, pencils, timer"
                ]
            },
            {
                "title": "Brain Fuel",
                "items": [
                    "Nuts, dark chocolate, fruit, green tea"
                ]
            },
            {
                "title": "Atmosphere",
                "items": [
                    "Good lighting, silence or calm background music (classical, lo-fi)"
                ]
            }
        ],
        "dresscode": [
            {
                "emoji": "🎓",
                "title": "Professor Style",
                "description": "Cosy cardigans, glasses for a dignified look, and slippers"
            },
            {
                "emoji": "🧠",
                "title": "Home Geniuses",
                "description": "Comfortable tracksuits and a focused look"
            },
            {
                "emoji": "🔍",
                "title": "Sherlock and Watson",
                "description": "Plaid shirts or waistcoats"
            }
        ],
        "topics": {
            "show": true,
            "icon": "🧩",
            "title": "Intellectual Menu Examples",
            "items": [
                "Warm-up: easy rebuses or crossword puzzles",
                "Main course: a large themed crossword or a series of Sudoku puzzles",
                "Dessert: 'Danetki'—mysterious situations that need to be solved by asking yes/no questions"
            ]
        },
        "steps": [
            {
                "number": 1,
                "title": "Partner Warm-up: The Power of Two Minds",
                "content": "Start with a task where you are one team. Take a large crossword puzzle and solve it together. Try not to use the internet—it's much more interesting to figure out the answers yourself.",
                "ideas": [
                    "Say all your thoughts out loud, even the most absurd ones—sometimes they lead to the right solution"
                ]
            },
            {
                "number": 2,
                "title": "Intellectual Duel: Battle of Speed",
                "content": "Now for some healthy competition. Take identical tasks (for example, two identical Sudoku puzzles or a set of rebuses) and set a timer. Whoever solves them faster and more accurately wins.",
                "ideas": [
                    "The prize for the winner can be a joke: the right to choose a film for the evening or be exempt from washing the dishes",
                    "Make the task more difficult: during the round, you can ask your opponent one funny, distracting question"
                ]
            },
            {
                "number": 3,
                "title": "Joint Project: Riddle of the Evening",
                "content": "End the evening with a big, complex task that requires teamwork. A riddle or Einstein's puzzle would be ideal. The process of discussion, constructing theories and logical chains is what is valuable here.",
                "ideas": [
                    "Use a sheet of paper or a board to draw diagrams and write down key facts",
                    "Divide the roles: one person is responsible for 'logic' and eliminates incorrect versions, while the other is responsible for 'creativity' and generates the most daring hypotheses"
                ]
            },
            {
                "number": 4,
                "title": "Final Chord: Celebrating the Champions",
                "content": "Regardless of the outcome of the duel, in the end you are both winners because you had a great time and gave your brains a workout.",
                "ideas": [
                    "Come up with and write down in a notebook 'the most ingenious solution' and 'the funniest answer' of the evening"
                ]
            }
        ]
    },
    "oursecretlanguage": {
        "heroEmoji": "🌍",
        "title": "Our Secret Language - Date Plan",
        "subtitle": "Date Plan",
        "heroTitle": "Our Secret Language",
        "heroSubtitle": "Become pioneering linguists for an evening. Learn a new language together where mistakes are the main source of fun and create code words for your relationship",
        "sectionTitle": "Process: \"Linguistic Adventure\"",
        "checklist": [
            {
                "title": "Tools",
                "items": [
                    "A smartphone with Duolingo or a YouTube lesson, a notebook for writing down new phrases"
                ]
            },
            {
                "title": "Refreshments",
                "items": [
                    "Food or drinks from the chosen country (croissants for French, paella for Spanish)"
                ]
            },
            {
                "title": "Atmosphere",
                "items": [
                    "Music in the style of the chosen country (Italian pop, French chanson, Spanish guitar)"
                ]
            }
        ],
        "dresscode": [
            {
                "emoji": "🗼",
                "title": "Tourists",
                "description": "Berets and striped shirts for French, sombreros for Spanish"
            },
            {
                "emoji": "🏳️",
                "title": "Flag Colours",
                "description": "Dress in the colours of the flag of the country whose language you are learning"
            }
        ],
        "topics": {
            "show": true,
            "icon": "🌍",
            "title": "Language Examples",
            "items": [
                "Romantic: Italian ('Sei la cosa più bella che mi sia mai capitata'), French",
                "Exotic: Japanese ('Anata no koto ga suki desu' — 'I like you')",
                "What to learn: hello/goodbye, thank you/please, 10-15 funny or cute phrases, compliments, 'I love you'"
            ]
        },
        "steps": [
            {
                "number": 1,
                "title": "Lesson One: Basics of Communication",
                "content": "Choose 10-15 phrases. Turn on the audio and repeat them one by one, exaggerating the intonation. Don't be afraid to sound ridiculous—that's the whole point.",
                "ideas": [
                    "Hold a competition for the most theatrical and emotional pronunciation",
                    "Record yourself pronouncing the phrases on a voice recorder, and then laugh at the result together"
                ]
            },
            {
                "number": 2,
                "title": "Practice: Role-Playing",
                "content": "Act out mini-scenes using only the words and gestures you have learned. This turns learning into a fun performance.",
                "ideas": [
                    "'First Date in Rome': exchange compliments and ask simple questions",
                    "'Ordering in a Parisian café': try ordering two coffees and two croissants",
                    "'Lost tourists': use gestures and a few words to explain that you are looking for directions to your hotel"
                ]
            },
            {
                "number": 3,
                "title": "Full Immersion: 30 Minutes Without Translation",
                "content": "Set a rule: for half an hour, you will only communicate in the new language. Anything you cannot say, you must show.",
                "ideas": [
                    "Deliberately use words incorrectly to confuse and amuse your partner",
                    "Try to describe your day using 5-6 words you know"
                ]
            },
            {
                "number": 4,
                "title": "Final Chord: The Birth of Your Word",
                "content": "At the end of the evening, come up with your own 'paired' word—a funny hybrid of the new language and your inner humour. It will become your secret code.",
                "ideas": [
                    "Write this word and its 'translation' in a notebook. For example, 'croissant-amore'—morning coffee in bed"
                ]
            }
        ]
    },
    "livebroadcast": {
        "heroEmoji": "🎧",
        "title": "Live Broadcast - Date Plan",
        "subtitle": "Date Plan",
        "heroTitle": "Live Broadcast",
        "heroSubtitle": "Co-host the most exclusive podcast in the world with only two listeners: yourselves. Create an audio time capsule preserving your voices, stories, and laughter",
        "sectionTitle": "Process: \"Recording Begins: 3... 2... 1...\"",
        "checklist": [
            {
                "title": "Studio",
                "items": [
                    "A smartphone with a voice recorder app, a notebook for the episode plan"
                ]
            },
            {
                "title": "Special Effects",
                "items": [
                    "You can find short jingles or applause sounds on YouTube in advance"
                ]
            },
            {
                "title": "Atmosphere",
                "items": [
                    "A quiet place, a sofa with cushions, dim lighting, headphones around your neck for ambience"
                ]
            }
        ],
        "dresscode": [
            {
                "emoji": "🎙️",
                "title": "Morning Show Hosts",
                "description": "Cosy shirts, jeans, glasses"
            },
            {
                "emoji": "🎸",
                "title": "Rock Stars Being Interviewed",
                "description": "T-shirts with your favourite bands"
            }
        ],
        "topics": {
            "show": true,
            "icon": "📻",
            "title": "Episode Topic Examples",
            "items": [
                "'Our story': how we met, funniest date, plans for the future",
                "Our top 3: films, dishes or trips we want to discuss",
                "'Week in review': your past week as a TV series—with a plot and characters",
                "'What if...?'—fantasise about 'what if we won the lottery / could travel through time'"
            ]
        },
        "steps": [
            {
                "number": 1,
                "title": "Planning: The Structure of the Episode",
                "content": "Start with an 'editorial meeting.' Come up with a name for your podcast, choose a topic, and sketch out a simple plan with 3-4 sections.",
                "ideas": [
                    "Title: 'Sitting and talking,' 'Radio Hugs,' 'Two on the air'",
                    "Sections: 'Silliness of the week,' 'Discovery of the week,' 'Memory of the week'"
                ]
            },
            {
                "number": 2,
                "title": "On Air: The Magic of the Voice",
                "content": "Turn on the recorder and just start talking, following your plan. Don't be afraid of pauses, laughter, and unexpected twists—that's what makes the recording come alive.",
                "ideas": [
                    "Act out an 'interview': one person asks questions, the other answers as the 'guest star'",
                    "Add sound effects between sections to create the atmosphere of a real show",
                    "Come up with a short and funny 'commercial break' about your cat or your favourite tea"
                ]
            },
            {
                "number": 3,
                "title": "Post-Production: First Listen",
                "content": "Record 15–20 minutes of airtime. Then stop the recording, get comfortable (you can even share a pair of headphones) and listen to the result. Hearing your voices and the dynamics of the conversation from the outside is a unique experience.",
                "ideas": [
                    "Discuss what was particularly funny and what was unexpectedly touching",
                    "Name your file 'Episode 1' and save it in a separate folder"
                ]
            },
            {
                "number": 4,
                "title": "Final Chord: Announcement of the Next Issue",
                "content": "End the evening by discussing topics for the next 'episode.'",
                "ideas": [
                    "Agree to listen to this recording again in exactly one year. It will be better than any photograph because voices preserve not only information but also the vivid emotions of the moment"
                ]
            }
        ]
    },
    "laboratoryofmiracles": {
        "heroEmoji": "🌋",
        "title": "Laboratory of Miracles - Date Plan",
        "subtitle": "Date Plan",
        "heroTitle": "Laboratory of Miracles",
        "heroSubtitle": "Transform your kitchen into a secret laboratory for exciting experiments. Experience children's delight as real magic and chemistry happen right on your table",
        "sectionTitle": "Process: \"Great Discoveries in the Kitchen\"",
        "checklist": [
            {
                "title": "Reagents",
                "items": [
                    "Baking soda, vinegar, milk, food colouring, dishwashing liquid, vegetable oil, effervescent tablets"
                ]
            },
            {
                "title": "Equipment",
                "items": [
                    "Tray, glasses, jars, cotton buds, plastic bottle"
                ]
            },
            {
                "title": "Atmosphere",
                "items": [
                    "Cover the table with newspapers, play the soundtrack from the film Back to the Future"
                ]
            }
        ],
        "dresscode": [
            {
                "emoji": "🔬",
                "title": "Mad Scientists",
                "description": "White shirts or T-shirts, tousled hair, and safety goggles for laughter"
            },
            {
                "emoji": "🧪",
                "title": "Lab Assistants",
                "description": "Simple clothes that you don't mind getting dirty"
            }
        ],
        "topics": {
            "show": false
        },
        "steps": [
            {
                "number": 1,
                "title": "Preparation for Launch: Opening the Laboratory",
                "content": "Put on your 'lab coats,' lay out the equipment, and come up with nicknames for each other, such as 'Professor Chaos' and 'Doctor Rainbow.'",
                "ideas": [
                    "Hold a grand opening ceremony for the 'YourName Laboratory' with a short, dramatic speech"
                ]
            },
            {
                "number": 2,
                "title": "Experiment No. 1: 'Volcano in a Bottle' (Eruption of Feelings)",
                "content": "Pour baking soda into a plastic bottle on a tray, add food colouring and quickly pour in vinegar. Watch as the bright 'lava' bubbles and bursts out, and shout excitedly, 'It's alive!'",
                "ideas": [
                    "Have a competition to see whose 'volcano' will be taller and more impressive",
                    "Give your volcano a name and make up a legend about it"
                ]
            },
            {
                "number": 3,
                "title": "Experiment #2: 'Galaxy in Milk' (Dance of Colours)",
                "content": "Add a few drops of different food colourings to a plate of milk. Dip a cotton bud in washing-up liquid and touch it to the milk. The colours will begin to spread and swirl in a mesmerising dance.",
                "ideas": [
                    "Hold a competition for the most beautiful 'galaxy'",
                    "Take some macro photos of the resulting patterns—they look fantastic"
                ]
            },
            {
                "number": 4,
                "title": "Final Chord: 'Homemade Lava Lamp'",
                "content": "Fill a glass with water and food colouring, add oil on top and drop in an effervescent tablet. Watch the coloured bubbles rise and fall meditatively.",
                "ideas": [
                    "Turn off the lights and illuminate the glass with a torch from your phone. Effect will be magical. End the evening by discussing which 'discovery' impressed you the most"
                ]
            }
        ]
    },
    "talesintwilight": {
        "heroEmoji": "🔦",
        "title": "Tales in the Twilight - Date Plan",
        "subtitle": "Date Plan",
        "heroTitle": "Tales in the Twilight",
        "heroSubtitle": "Light and darkness become your actors. Create exciting stories with a torch, your hands, and boundless imagination in a shadow puppet theatre",
        "sectionTitle": "Process: \"The Show is About to Begin!\"",
        "checklist": [
            {
                "title": "Stage",
                "items": [
                    "A smooth, light-coloured wall or a stretched white sheet"
                ]
            },
            {
                "title": "Spotlight",
                "items": [
                    "A phone torch or a table lamp without a lampshade"
                ]
            },
            {
                "title": "Actors",
                "items": [
                    "Your hands and cardboard cut-outs (trees, a house, the moon)"
                ]
            },
            {
                "title": "Props",
                "items": [
                    "Chopsticks or pencils to hold the figures in place"
                ]
            },
            {
                "title": "Auditorium",
                "items": [
                    "A cosy nest of cushions and blankets on the floor"
                ]
            }
        ],
        "dresscode": [
            {
                "emoji": "🎭",
                "title": "Theatregoers",
                "description": "All black, like stage workers, so as not to distract from the shadows"
            },
            {
                "emoji": "🦄",
                "title": "Fairytale Pyjamas",
                "description": "Cosy and fun kigurumi"
            },
            {
                "emoji": "🎨",
                "title": "Bohemian",
                "description": "Sweaters, berets, and creative scarves"
            }
        ],
        "topics": {
            "show": true,
            "icon": "📖",
            "title": "Plot Examples",
            "items": [
                "'The story of how we met': in a funny and grotesque form",
                "'An alternative fairy tale': what if Kolobok met the Terminator?",
                "'The secret life of our cat': what does he do while you are away from home?"
            ]
        },
        "steps": [
            {
                "number": 1,
                "title": "Workshop: Creating Actors",
                "content": "Start with preparation. Practise making classic shapes with your hands: a dog, a bird, a hare. Then cut out a few simple silhouettes from cardboard and attach them to sticks.",
                "ideas": [
                    "Give your cardboard characters funny names: 'Dragon Innokenty' or 'Rebellious Princess'",
                    "Conduct a 'dress rehearsal' to check how the shadows look on the wall"
                ]
            },
            {
                "number": 2,
                "title": "Act One: The Narrator and Puppeteer",
                "content": "Assign roles: one person narrates and voices the characters, while the other brings the shadows to life. Don't be afraid to improvise and take the story in unexpected directions.",
                "ideas": [
                    "Choose a plot from the examples or create your own",
                    "Use different voices for different characters"
                ]
            },
            {
                "number": 3,
                "title": "Act II: Creative Duo",
                "content": "Swap roles or try complete improvisation: each person controls their character and speaks only for them. The dialogues will be unpredictable and very funny.",
                "ideas": [
                    "Act out a dispute between two shadows about which of them is more important",
                    "Have your shadow animals teach the shadow man how to fly"
                ]
            },
            {
                "number": 4,
                "title": "Final Chord: Curtain",
                "content": "End your performance with the most symbolic moment—the appearance of a shadow heart on the wall, which you will show together by placing your palms together. This will be a beautiful final scene.",
                "ideas": [
                    "Film a short clip of your best sketch or take a photo of the final heart to preserve the memory of your unique theatrical premiere"
                ]
            }
        ]
    },
    "secretpicnic": {
        "heroEmoji": "🧺",
        "title": "Secret Picnic - Date Plan",
        "subtitle": "Date Plan",
        "heroTitle": "Secret Picnic",
        "heroSubtitle": "Who needs a meadow? Your balcony or window corner becomes the cosiest romantic spot in the city with twinkling lights, delicious food and conversations under the sky",
        "sectionTitle": "Process: \"An Evening Under the Sky at Home\"",
        "checklist": [
            {
                "title": "Meadow",
                "items": [
                    "A soft blanket, lots of pillows"
                ]
            },
            {
                "title": "Bonfire",
                "items": [
                    "Safe LED candles or warm-light garlands"
                ]
            },
            {
                "title": "Basket",
                "items": [
                    "A tray with food, a thermos with a hot drink, beautiful tableware"
                ]
            },
            {
                "title": "Atmosphere",
                "items": [
                    "Turn off the lights in the room, leaving only the 'bonfire' and the city lights outside the window"
                ]
            }
        ],
        "dresscode": [
            {
                "emoji": "🧥",
                "title": "Cosy Casual",
                "description": "Chunky sweaters, jeans, warm socks"
            },
            {
                "emoji": "👕",
                "title": "Country Chic",
                "description": "Light shirts, cardigans, relaxed style"
            }
        ],
        "topics": {
            "show": true,
            "icon": "🧺",
            "title": "Picnic Basket Examples",
            "items": [
                "Classic: cheese, baguette, grapes, olives, thermos with mulled wine",
                "Hearty set: mini sandwiches, bruschetta, hummus with vegetable sticks",
                "Sweet set: thermos with cocoa, croissants, berries, chocolate"
            ]
        },
        "steps": [
            {
                "number": 1,
                "title": "Sounds of Nature: Full Immersion",
                "content": "Instead of regular music, play the sounds of nature in the background: the crackling of a fire, the singing of night crickets, or the sounds of the forest. In the silence of a city apartment, this creates an incredible sense of presence.",
                "ideas": [
                    "Find the long video 'Campfire 10 hours' on YouTube for maximum immersion"
                ]
            },
            {
                "number": 2,
                "title": "Entertainment During a Break: Quiet Games",
                "content": "After dinner, move on to entertainment that resembles real camping trips.",
                "ideas": [
                    "Card games: Uno or a simple deck of cards for playing Fool",
                    "Cities or I Spy: using the lights and objects outside the window",
                    "Live music: if someone plays the guitar or ukulele, it will be the perfect addition to the evening"
                ]
            },
            {
                "number": 3,
                "title": "Campfire Stories: Let's Make Them Up Together",
                "content": "Instead of the usual chit-chat, make up a story together. One person starts with a phrase ('Once upon a dark, dark night on the roof of the neighbouring house...'), the next person picks up and continues.",
                "ideas": [
                    "Try different genres: a funny fairy tale, a fantasy story, or even a 'scary story' in which your cat turns out to be the main villain"
                ]
            },
            {
                "number": 4,
                "title": "Final Chord: Stargazing",
                "content": "End the evening by simply gazing at the night sky (or the city lights). Try to find familiar constellations or invent your own, giving them names related to your story.",
                "ideas": [
                    "Take a photo of your 'picnic' so that it captures your cosy corner and the view outside the window"
                ]
            }
        ]
    },
    "roomoftrust": {
        "heroEmoji": "🤍",
        "title": "Room of Trust: Heart-to-Heart Talk - Date Plan",
        "subtitle": "Date Plan",
        "heroTitle": "Room of Trust: Heart-to-Heart Talk",
        "heroSubtitle": "Sometimes the most important date is a quiet moment to truly hear each other. A safe space where there is no judgement, only attention and acceptance",
        "sectionTitle": "Process: \"Dialogue of the Hearts\"",
        "checklist": [
            {
                "title": "Questions",
                "items": [
                    "Prepare a list of 15–20 questions in advance (you can take them from '36 Questions to Fall in Love' or make up your own)"
                ]
            },
            {
                "title": "Atmosphere",
                "items": [
                    "Dim lighting, candles, comfortable seats facing each other. Leave your phones in another room"
                ]
            },
            {
                "title": "Drinks",
                "items": [
                    "A cup of fragrant tea or a glass of wine to create a cosy atmosphere"
                ]
            }
        ],
        "dresscode": [
            {
                "emoji": "💫",
                "title": "Absolute Comfort",
                "description": "The softest and most comfortable homewear that makes you feel relaxed"
            }
        ],
        "topics": {
            "show": true,
            "icon": "💬",
            "title": "Sample Questions (from Simple to Complex)",
            "items": [
                "Warm-up: 'What is your happiest childhood memory?' 'What are you grateful for right now?'",
                "Deeper: 'What are you most afraid of?', 'What is your biggest, even impossible dream?'",
                "About relationships: 'When did you realise you were in love with me?', 'What can I do to make you feel more loved?'"
            ]
        },
        "steps": [
            {
                "number": 1,
                "title": "Safety Rules: Our Agreement",
                "content": "Start by establishing three simple but important rules: 1) No judgement. We listen to understand, not to evaluate. 2) The right to 'stop.' Anyone can skip a question without explanation. 3) Everything said stays here. This is your personal space.",
                "ideas": [
                    "Say these rules out loud together to make them official"
                ]
            },
            {
                "number": 2,
                "title": "Taking Turns to Speak: The Art of Listening",
                "content": "One of you asks a question from the list, the other answers. Then the person who answered asks the next question. Don't rush, give each other time to think. The most important thing is not the answer, but the attention with which you listen.",
                "ideas": [
                    "After your partner responds, don't rush to move on to the next question. You can say, 'Thank you for sharing,' or ask a clarifying question to show that you have really listened"
                ]
            },
            {
                "number": 3,
                "title": "End on a Warm Note: Focus on Love",
                "content": "Let the last few questions be about gratitude, value, and love in your relationship. Examples: 'What is your most cherished memory of us together?' 'What quality do you value most in me?'",
                "ideas": [
                    "These final questions should leave you both feeling warm and appreciated"
                ]
            },
            {
                "number": 4,
                "title": "Final Chord: Silence After Words",
                "content": "After the last answer, don't rush to turn on the music or get back to business. Just sit in silence for a few minutes, hugging or holding hands. Allow the warmth and closeness that filled the room to remain with you.",
                "ideas": [
                    "Write down in a notebook one answer from your partner that touched you the most. This will be your little memento of the evening"
                ]
            }
        ]
    },
    "fortunetellingsalon": {
        "heroEmoji": "🔮",
        "title": "Fortune-Telling Salon: What Awaits Us? - Date Plan",
        "subtitle": "Date Plan",
        "heroTitle": "Fortune-Telling Salon: What Awaits Us?",
        "heroSubtitle": "Your room becomes a mysterious salon where the future reveals its secrets. Become oracles for each other with shared dreams, hopes, and funny predictions you'll fulfil yourselves",
        "sectionTitle": "Process: \"A Session of Magic and Laughter\"",
        "checklist": [
            {
                "title": "Fortune-Telling Deck",
                "items": [
                    "You can use ready-made cards, but it's more fun to make your own"
                ]
            },
            {
                "title": "Atmosphere",
                "items": [
                    "Candles, aroma lamp (sandalwood, lavender), dark tablecloth or blanket for 'fortune-telling table', mystical music (Enigma, ambient)"
                ]
            }
        ],
        "dresscode": [
            {
                "emoji": "🔮",
                "title": "Mysterious Magicians",
                "description": "Drape blankets over your shoulders like cloaks, draw symbols on your hands"
            },
            {
                "emoji": "💃",
                "title": "Gypsy Camp",
                "description": "Bright scarves, bracelets, shawls"
            }
        ],
        "topics": {
            "show": true,
            "icon": "🃏",
            "title": "Card Examples for Your Deck",
            "items": [
                "Sudden Pizza Card: in the next 48 hours, you will have an unexpected and very tasty dinner",
                "Lost Sock Card: the mystery of the missing sock will be revealed, but it will lead to a new mystery",
                "The Great Series Card: you will find a show that will captivate you both and cancel all your plans",
                "Lazy Seal Card: predicts a weekend spent horizontal under a blanket",
                "Sudden Kiss Card: be on the lookout, a tender and unexpected kiss awaits you in the next 24 hours"
            ]
        },
        "steps": [
            {
                "number": 1,
                "title": "Arcana Workshop: Creating a Deck",
                "content": "If you have chosen the DIY option, start the evening by making the cards together. Come up with predictions, draw symbols—this is already the fun and creative part of the date.",
                "ideas": [
                    "Take 15–20 pieces of cardboard and write down simple, funny and romantic predictions that you can fulfil in the coming days"
                ]
            },
            {
                "number": 2,
                "title": "The 'Us' Spread: What Awaits the Couple?",
                "content": "Sit opposite each other. One is the 'oracle,' the other is the 'client.' The client asks a question ('What awaits us this week?'). The oracle draws three cards and interprets them with a wise look. Then switch roles.",
                "ideas": [
                    "Interpret the cards as freely and humorously as possible, linking them into a single story. 'The pizza card says that on the way to the lazy seal, you will face a test with delicious food'"
                ]
            },
            {
                "number": 3,
                "title": "Prophecy of the Day: Personal Advice",
                "content": "At the end, everyone draws one card for themselves. This is a small prediction or task for tomorrow.",
                "ideas": [
                    "Write these predictions in the 'Book of Destiny' (notebook) and the next day, check what came true (or what you accomplished)"
                ]
            },
            {
                "number": 4,
                "title": "Final Chord: Magic in Your Hands",
                "content": "Discuss which prediction you liked the most.",
                "ideas": [
                    "Choose one card from the spread and agree to 'fulfil' its prophecy together tomorrow. After all, the best magic is the magic we create ourselves"
                ]
            }
        ]
    },
    "couchtravel": {
        "heroEmoji": "📍",
        "title": "Couch Travel - Date Plan",
        "subtitle": "Date Plan",
        "heroTitle": "Couch Travel",
        "heroSubtitle": "Your laptop is a portal to anywhere in the world. Randomly choose a city and 'live' there for one perfect day without leaving your sofa",
        "sectionTitle": "Process: \"24 Hours in a New City\"",
        "checklist": [
            {
                "title": "Portal",
                "items": [
                    "A laptop with internet access (Google Maps, Street View, travel blogs)"
                ]
            },
            {
                "title": "Lottery",
                "items": [
                    "Online random city generator or simply a spinning globe"
                ]
            },
            {
                "title": "Travel Diary",
                "items": [
                    "A notebook and pen to record your route"
                ]
            },
            {
                "title": "Atmosphere",
                "items": [
                    "Spread out around the map, turn on music from around the world, and make a cosy 'nest' out of pillows"
                ]
            }
        ],
        "dresscode": [
            {
                "emoji": "🎒",
                "title": "Experienced Travellers",
                "description": "Comfortable clothes, panama hats, sunglasses"
            },
            {
                "emoji": "🏖️",
                "title": "Resort Chic",
                "description": "Light linen shirts and dresses"
            }
        ],
        "topics": {
            "show": false
        },
        "steps": [
            {
                "number": 1,
                "title": "The Grand Departure: Draw Lots!",
                "content": "Solemnly decide on your city for today. Once it's chosen, quickly find 2-3 interesting facts about it to set the tone for the trip.",
                "ideas": [
                    "Use an online random city generator or close your eyes and point at a map"
                ]
            },
            {
                "number": 2,
                "title": "Planning Your Route: From Dawn to Dusk",
                "content": "Open Google Maps and start planning your perfect day. One of you is the 'logistician' (searching for routes in Street View), the other is the 'tour guide' (searching for interesting places and facts).",
                "ideas": [
                    "Morning (9:00): find an authentic coffee shop for breakfast and take a 'walk' through the streets around it using Street View",
                    "Afternoon (1:00 p.m.): Choose a restaurant with a national dish you'd like to try. Then, 'visit' a market or observation deck",
                    "Evening (7:00 p.m.): Find a beautiful place to watch the sunset and choose a restaurant for dinner"
                ]
            },
            {
                "number": 3,
                "title": "Full Immersion: The Taste of Travel",
                "content": "To make the trip even more real, order dinner from the cuisine of the country you have 'visited'.",
                "ideas": [
                    "While 'walking' around Street View, take screenshots of the most beautiful places—these will be your 'photos' from the trip"
                ]
            },
            {
                "number": 4,
                "title": "Final Touch: A Souvenir to Remember",
                "content": "Record your plan in a 'travel diary'. Draw a map of your route, write down the names of places and dishes, and paste in your screenshot 'photos'.",
                "ideas": [
                    "Create a mini-playlist of 3-4 songs on a music service that will now be associated with this 'journey'. Your travel diary will become not just a fantasy, but the first step towards planning a real trip"
                ]
            }
        ]
    },
    "worldbuilders": {
        "heroEmoji": "🧩",
        "title": "World Builders: Piecing It Together - Date Plan",
        "subtitle": "Date Plan",
        "heroTitle": "World Builders: Piecing It Together",
        "heroSubtitle": "Forget the chaos and speed of the outside world. Tonight, you are architects and creators, building something beautiful out of hundreds of tiny pieces—a true meditation for two",
        "sectionTitle": "The Process: \"Meditation with Four Hands\"",
        "checklist": [
            {
                "title": "The Project",
                "items": [
                    "A new LEGO set or a massive puzzle (1000+ pieces)"
                ]
            },
            {
                "title": "Workspace",
                "items": [
                    "A big table or a puzzle mat",
                    "bowls for sorting pieces"
                ]
            },
            {
                "title": "The Vibe",
                "items": [
                    "Bright but cozy lighting",
                    "an interesting podcast or audiobook playing in the background",
                    "a calm playlist with no lyrics"
                ]
            }
        ],
        "dresscode": [
            {
                "emoji": "🧸",
                "title": "Maximum Comfort",
                "description": "Your softest loungewear that you can relax in for hours"
            },
            {
                "emoji": "🌟",
                "title": "Superfans",
                "description": "T-shirts with prints like Star Wars or Harry Potter if building a themed set"
            }
        ],
        "topics": {
            "show": true,
            "icon": "🧩",
            "title": "Project Examples",
            "items": [
                "Puzzle: A calming landscape, a world map, a fantasy scene, or a copy of a favorite painting",
                "LEGO Architecture series (for the aesthetes)",
                "LEGO Botanical Collection (for nature lovers)",
                "Sets from your favorite movies"
            ]
        },
        "steps": [
            {
                "number": 1,
                "title": "The Sorting Center: The Grand Opening",
                "content": "Solemnly open the box. The first step is sorting together. If it's a puzzle, hunt for the corners and edge pieces. If it's LEGO, separate the bricks by color or type. This calms you down and sets the mood for teamwork.",
                "ideas": [
                    "Assign silly roles like \"Manager of the Edge Department\" or \"Director of Blue Bricks\"",
                    "Have a mini-contest to see who can find 10 corner pieces fastest"
                ]
            },
            {
                "number": 2,
                "title": "Construction of the Century: Flow and Chat",
                "content": "Dive into the zone. There is no race, just a shared mission. You'll notice conversations starting naturally—about little things, plans, and dreams. Even the comfortable silence becomes part of the meditation.",
                "ideas": [
                    "Split responsibilities: \"I'll build the sky, you build the castle\"",
                    "Make up backstories for random pieces: \"This piece is actually a portal to another dimension\""
                ]
            },
            {
                "number": 3,
                "title": "The Final Touch: Moment of Triumph",
                "content": "When that last piece clicks into place, it's a small but super satisfying victory. Don't rush; enjoy the moment of finishing your big joint project.",
                "ideas": [
                    "Give yourselves a round of applause",
                    "Take a victory selfie with your masterpiece"
                ]
            },
            {
                "number": 4,
                "title": "The Curtain Call: One-Night Exhibition",
                "content": "Leave your building or puzzle out on display. Let it decorate the room for a few days as a symbol of your patience, harmony, and a great evening.",
                "ideas": [
                    "Give your project an official title and make a little museum plaque to put next to it"
                ]
            }
        ]
    },
    "totalimmersion": {
        "heroEmoji": "🧙‍♂️",
        "title": "Total Immersion: Night in the Cinematic Universe - Date Plan",
        "subtitle": "Date Plan",
        "heroTitle": "Total Immersion: Night in the Cinematic Universe",
        "heroSubtitle": "Forget just watching a movie. Tonight, you aren't the audience—you are part of the action! Pick a favorite movie universe and turn your living room into a branch of that world",
        "sectionTitle": "The Process: \"Night at the Movies\"",
        "checklist": [
            {
                "title": "Cinema",
                "items": [
                    "A chosen trilogy or a few episodes of a series",
                    "projector or big TV"
                ]
            },
            {
                "title": "Decor",
                "items": [
                    "Props that match the vibe (candles for Lord of the Rings, office sticky notes for The Office)"
                ]
            },
            {
                "title": "The Vibe",
                "items": [
                    "A dark room",
                    "movie soundtrack playing before you start watching",
                    "outfits and menu tailored to your universe"
                ]
            }
        ],
        "dresscode": [
            {
                "emoji": "🧝",
                "title": "Lord of the Rings",
                "description": "Cozy Hobbits (vests, shirts) or elegant Elves (light and flowy)"
            },
            {
                "emoji": "🔍",
                "title": "True Detective",
                "description": "Simple worn-out shirts, earthy tones"
            },
            {
                "emoji": "📎",
                "title": "The Office",
                "description": "Boring office shirts, name badges with character names"
            }
        ],
        "topics": {
            "show": true,
            "icon": "🍿",
            "title": "Universe Menu Ideas",
            "items": [
                "Lord of the Rings: \"Lembas\" bread (simple cookies), mushrooms in sour cream, cheese, berry juice",
                "True Detective: Pizza and beer in cans, Rust Cohle style",
                "The Office: Pretzels, Dwight's beet salad, Kevin's famous chili"
            ]
        },
        "steps": [
            {
                "number": 1,
                "title": "The Portal is Open: Welcome",
                "content": "Get changed, start the soundtrack, and set out the food. The atmosphere should be set before you hit \"Play.\"",
                "ideas": [
                    "Decide exactly who you are today—hobbits, detectives, or office clerks",
                    "Call each other by those character names all evening"
                ]
            },
            {
                "number": 2,
                "title": "Interactive Viewing: Full Dive",
                "content": "Don't watch passively; watch actively! React, play along, be part of the story.",
                "ideas": [
                    "Invent a drinking game: take a sip every time a hero says their catchphrase",
                    "Repeat iconic lines along with the characters",
                    "Loudly cheer for the heroes or roast their bad decisions"
                ]
            },
            {
                "number": 3,
                "title": "Intermission: Sharing Theories",
                "content": "Take breaks between movies or episodes. It's not just for snack refills, it's part of the immersion.",
                "ideas": [
                    "Share theories on what happens next",
                    "Argue about the characters' motivations",
                    "Pick the \"Most Annoying\" and \"Most Loved\" character and defend your choice"
                ]
            },
            {
                "number": 4,
                "title": "The Final Chord: Post-Credits",
                "content": "When it's over, don't just turn it off. Sit for a few minutes while the credits roll and discuss the vibe.",
                "ideas": [
                    "Take a \"Cast Photo\"—a selfie in costume with the credits on the screen behind you"
                ]
            }
        ]
    },
    "universityfortwo": {
        "heroEmoji": "🎓",
        "title": "University for Two: The Faculty of Cool Ideas - Date Plan",
        "subtitle": "Date Plan",
        "heroTitle": "University for Two: The Faculty of Cool Ideas",
        "heroSubtitle": "For one night, your living room becomes the world's most prestigious university with only two students and unlimited courses. Tonight is for diving into new knowledge and inspiring ideas together",
        "sectionTitle": "The Process: \"Intellectual Journey\"",
        "checklist": [
            {
                "title": "The Classroom",
                "items": [
                    "Laptop or TV with internet",
                    "notebooks for taking notes"
                ]
            },
            {
                "title": "Student Life",
                "items": [
                    "A thermos of tea or coffee",
                    "comfy chairs",
                    "blankets"
                ]
            },
            {
                "title": "The Vibe",
                "items": [
                    "Dim lights (but bright enough to write)",
                    "total silence",
                    "phones on silent mode"
                ]
            }
        ],
        "dresscode": [
            {
                "emoji": "🎓",
                "title": "Professor Style",
                "description": "Tweed jackets, glasses, cardigans"
            },
            {
                "emoji": "📚",
                "title": "Eternal Students",
                "description": "Cozy hoodies, jeans, sneakers"
            },
            {
                "emoji": "🏛️",
                "title": "Ivy League",
                "description": "Shirts, sweaters, vests"
            }
        ],
        "topics": {
            "show": true,
            "icon": "📖",
            "title": "Course Catalog Examples",
            "items": [
                "Pop-Science: Space, neuroscience, art history (TED Talks, YouTube channels)",
                "Practical Skills: Photography basics, relationship psychology, storytelling (Coursera, YouTube)",
                "Virtual Field Trips: The Louvre, the Hermitage, or other world museums (Google Arts & Culture)"
            ]
        },
        "steps": [
            {
                "number": 1,
                "title": "Choosing a Major: Navigating Interests",
                "content": "Decide together what you're curious about today. Choosing is part of the date—it's a chance to share your current obsessions.",
                "ideas": [
                    "If your interests don't match, agree to watch two short lectures—one of yours and one of theirs"
                ]
            },
            {
                "number": 2,
                "title": "Lecture Hall: Deep Dive",
                "content": "Start the lecture. Watch closely, but don't make it feel like an exam. Jot down notes if a thought really grabs you.",
                "ideas": [
                    "Try to guess what the speaker will say next",
                    "Write down the \"Quote of the Evening\"—the strongest thought from the lecture"
                ]
            },
            {
                "number": 3,
                "title": "Seminar: Sharing Opinions",
                "content": "After watching (or during a pause), discuss what you learned. Don't just summarize it; share how it made you feel. Ask each other: \"What surprised you the most?\" \"Do you agree, or do you want to argue with that?\" \"How can we apply this to our life?\"",
                "ideas": [
                    "Play devil's advocate even if you agree, just to spark debate",
                    "Connect the topic to something from your shared experience"
                ]
            },
            {
                "number": 4,
                "title": "The Final Chord: Homework",
                "content": "End the evening by cementing the knowledge with a fun little \"assignment.\"",
                "ideas": [
                    "Make up one question for each other based on the lecture and answer it",
                    "Create a \"Gradebook\" for your university and give yourselves a \"Pass\" for the course"
                ]
            }
        ]
    },
    "lightsout": {
        "heroEmoji": "🕯️",
        "title": "When the Lights Went Out: An Evening from the Past - Date Plan",
        "subtitle": "Date Plan",
        "heroTitle": "When the Lights Went Out: An Evening from the Past",
        "heroSubtitle": "Imagine you've traveled back to the era before electricity. All you have is live fire, silence, books, and each other's thoughts—a digital detox and time travel trip",
        "sectionTitle": "The Process: \"By the Light of Living Fire\"",
        "checklist": [
            {
                "title": "Lighting",
                "items": [
                    "Lots of candles in safe holders",
                    "matches"
                ]
            },
            {
                "title": "Entertainment",
                "items": [
                    "A book of short stories or poems",
                    "a deck of cards",
                    "chess or checkers"
                ]
            },
            {
                "title": "Writing",
                "items": [
                    "Nice paper and a pen"
                ]
            }
        ],
        "dresscode": [
            {
                "emoji": "📖",
                "title": "Novel Heroes",
                "description": "Simple shirts, long dresses, cozy shawls"
            },
            {
                "emoji": "🧶",
                "title": "Intellectual Cozy",
                "description": "Knitted cardigans and wool socks"
            },
            {
                "emoji": "🌙",
                "title": "Retro Pajamas",
                "description": "Simple sleepwear without loud prints"
            }
        ],
        "topics": {
            "show": false
        },
        "steps": [
            {
                "number": 1,
                "title": "The Literary Salon: Pages Come Alive",
                "content": "Start by reading aloud. Take turns reading short stories (Chekhov, O. Henry) or poems. A voice in the quiet, lit by a candle, sounds completely unique.",
                "ideas": [
                    "Read with emotion, like actors in a home theater",
                    "Pause after each piece to discuss the feelings it evoked"
                ]
            },
            {
                "number": 2,
                "title": "Gentlemen's Games: Quiet Excitement",
                "content": "After reading, have a tournament of low-tech games. The score doesn't matter; it's about the slow rhythm and the chat between turns.",
                "ideas": [
                    "Make funny \"bets\" on the card game (e.g., loser makes coffee tomorrow morning)",
                    "Teach each other a simple card game from childhood"
                ]
            },
            {
                "number": 3,
                "title": "Candlelight Letters: Evening Chronicles",
                "content": "The climax of the night: letters. Grab paper and write a few lines to your partner: what you feel right now in this atmosphere, what you are grateful for, and what you expect from the future.",
                "ideas": [
                    "Swap letters and read them aloud by candlelight",
                    "Seal the letters in an envelope and agree to read them exactly one year from now"
                ]
            },
            {
                "number": 4,
                "title": "The Final Chord: Back to the Present",
                "content": "Before bed, blow out the candles. Sit in total darkness and silence for a minute.",
                "ideas": [
                    "When you turn the lights back on, discuss what element of this \"past\" you are missing in modern life"
                ]
            }
        ]
    },
    "ourlifeline": {
        "heroEmoji": "💘",
        "title": "Our Lifeline: Chronicles of a Great Love - Date Plan",
        "subtitle": "Date Plan",
        "heroTitle": "Our Lifeline: Chronicles of a Great Love",
        "heroSubtitle": "Your love story isn't just a set of memories; it's a journey. Today, you become cartographers of your own feelings and put everything that made you \"you\" onto paper",
        "sectionTitle": "The Process: \"Drawing the Memory Map\"",
        "checklist": [
            {
                "title": "The Map",
                "items": [
                    "A big roll of paper (craft paper or the back of wallpaper)",
                    "or several sheets of poster board"
                ]
            },
            {
                "title": "Tools",
                "items": [
                    "Colorful markers",
                    "pens",
                    "felt-tips",
                    "stickers"
                ]
            },
            {
                "title": "Archives (Optional)",
                "items": [
                    "A box of tickets, photos, and other keepsakes"
                ]
            }
        ],
        "dresscode": [
            {
                "emoji": "💝",
                "title": "Keepers of Memories",
                "description": "The coziest clothes for sitting on the floor for a long time"
            },
            {
                "emoji": "💫",
                "title": "Retro Romantics",
                "description": "Wear something that reminds you of your first dates"
            }
        ],
        "topics": {
            "show": true,
            "icon": "📍",
            "title": "Examples of Marks for Your Timeline",
            "items": [
                "Firsts: First date, first kiss, first \"I love you\"",
                "Big Decisions: Moving in together, getting a pet",
                "Travels: Little drawings of planes or cars with city names",
                "Inside Jokes: Symbols only you understand"
            ]
        },
        "steps": [
            {
                "number": 1,
                "title": "Point Zero: The Start of the Road",
                "content": "Roll out the paper and draw a long winding line. Mark two main points: \"The day we met\" and \"Today.\"",
                "ideas": [
                    "Draw a tiny symbol of your meeting next to the first date (a coffee cup, an app icon, a book)"
                ]
            },
            {
                "number": 2,
                "title": "Excavating Memories: History Milestones",
                "content": "Move along the timeline and take turns recalling key events. One person names a moment, and you decide together how to mark it—with a caption, a drawing, or a symbol.",
                "ideas": [
                    "Add small doodles for each memory: a heart, a plane, a house",
                    "Include the funny disasters too—they're part of your story"
                ]
            },
            {
                "number": 3,
                "title": "Dreams on the Horizon: Looking Forward",
                "content": "When your line hits \"Today,\" don't stop. Continue it with a dotted line—that's your future. Put your shared dreams and plans on this part of the map.",
                "ideas": [
                    "A trip to a dream country",
                    "Buying a house or car",
                    "Mastering a new hobby together",
                    "Add funny dreams like \"Adopt a capybara\""
                ]
            },
            {
                "number": 4,
                "title": "The Final Chord: Map Legend",
                "content": "When the map is done, hang it on the wall or spread it on the floor and look at it from a distance. You will see your whole history in one scale.",
                "ideas": [
                    "Roll the map into a scroll, tie it with a ribbon, and label it: \"Map of Our Love. Volume 1.\" Keep it and agree to take it out once a year to add to it"
                ]
            }
        ]
    },
    "perfectday": {
        "heroEmoji": "☕",
        "title": "The Perfect Day For You - Date Plan",
        "subtitle": "Date Plan",
        "heroTitle": "The Perfect Day For You",
        "heroSubtitle": "For one evening, you become personal \"genies\" secretly designing and presenting one ideal day off for each other—a chance to show how well you know your partner's dreams and little joys",
        "sectionTitle": "The Process: \"Operation Ideal Weekend\"",
        "checklist": [
            {
                "title": "Tools",
                "items": [
                    "Two big sheets of paper or notebooks",
                    "colorful pens"
                ]
            },
            {
                "title": "The Vibe",
                "items": [
                    "Sit so you can't see each other's work",
                    "play a calm playlist for focus"
                ]
            }
        ],
        "dresscode": [
            {
                "emoji": "✨",
                "title": "Dream Team",
                "description": "Cozy clothes that make it easy to dream and create"
            },
            {
                "emoji": "📋",
                "title": "Master Planners",
                "description": "Wear glasses for the look, keep a notebook handy"
            }
        ],
        "topics": {
            "show": true,
            "icon": "🕐",
            "title": "Structure of the Perfect Day",
            "items": [
                "Morning: How do they wake up? Breakfast? What music is playing?",
                "Afternoon: Activity, rest, or a walk? With whom? Where?",
                "Evening: How do they relax? Movies, music, bath, reading?",
                "The Little Joy: That specific detail that makes the day special"
            ]
        },
        "steps": [
            {
                "number": 1,
                "title": "Secret Design: Genie Work",
                "content": "Spend 20-30 minutes secretly writing out the perfect day for your partner. Recall phrases they dropped (\"I wish I could just...\"), favorite habits, and secret wishes.",
                "ideas": [
                    "Don't think about what you would like, but what would bring joy specifically to them"
                ]
            },
            {
                "number": 2,
                "title": "Presentation of Dreams: Showing Your Cards",
                "content": "Take turns presenting your plans. Do it like a beautiful story: \"Your ideal day starts with you waking up not to an alarm, but to the smell of fresh coffee and jazz...\"",
                "ideas": [
                    "During the presentation, the partner doesn't comment, just listens"
                ]
            },
            {
                "number": 3,
                "title": "Reality Check: Hitting the Target",
                "content": "After both presentations, discuss what matched, what was surprising, and what was especially touching. It's a super warm moment seeing how well your loved one \"gets\" you.",
                "ideas": [
                    "Let the partner mark the three most accurate \"hits\" in their ideal day"
                ]
            },
            {
                "number": 4,
                "title": "The Final Chord: From Dream to Plan",
                "content": "This is the most important step. Pick one of the designed days (or mix the best of both) and open your calendar right now. Find a free date soon and book it to make this dream happen.",
                "ideas": [
                    "Write \"Perfect Day for [Name]\" in the calendar and look forward to it like a real holiday"
                ]
            }
        ]
    },
    "blindfoldedtrust": {
        "heroEmoji": "🦯",
        "title": "Blindfolded Trust - Date Plan",
        "subtitle": "Date Plan",
        "heroTitle": "Blindfolded Trust",
        "heroSubtitle": "Sometimes trust and tenderness are born when we give up control and let our loved one lead us. This date turns your apartment into a symbolic maze where every step is an exercise in trust, attention, and care",
        "sectionTitle": "The Process: \"The Path of Trust\"",
        "checklist": [
            {
                "title": "The Route",
                "items": [
                    "Set up simple \"stations\" around the house (sofa, table, bed, kitchen)",
                    "add a little ritual to each"
                ]
            },
            {
                "title": "Obstacles",
                "items": [
                    "Pillows, chairs, blankets on the floor—a light but safe \"maze\""
                ]
            },
            {
                "title": "Gear",
                "items": [
                    "Blindfold or scarf",
                    "small treats",
                    "maybe small gifts"
                ]
            }
        ],
        "dresscode": [
            {
                "emoji": "🏠",
                "title": "Home Explorers",
                "description": "Cozy pajamas that are easy to move in"
            },
            {
                "emoji": "👑",
                "title": "Knight and Lady",
                "description": "Add a symbolic accessory (wreath, tie, cape) for the one leading or following"
            }
        ],
        "topics": {
            "show": true,
            "icon": "📍",
            "title": "Ideas for Stations",
            "items": [
                "Sofa: A kiss or a quick massage",
                "Table: Objects to guess by touch or a small treat (like chocolate)",
                "Bed: A note under the pillow to be read later",
                "Window: \"Raise your hand and feel the breeze\"—an element of surprise",
                "Bathroom: Washing hands with warm water for a feeling of care"
            ]
        },
        "steps": [
            {
                "number": 1,
                "title": "First Steps: Trust and Listen",
                "content": "One puts on the blindfold; the other gently takes their hand and guides them, giving voice prompts. Move slowly and carefully through the space.",
                "ideas": [
                    "Start with simple paths before adding obstacles",
                    "Use a calm, reassuring voice throughout"
                ]
            },
            {
                "number": 2,
                "title": "Stops for Tenderness",
                "content": "At every station, do your prepared ritual. Kiss on the sofa, guess the object at the table, feel the wind at the window, warm water washing hands in the bathroom.",
                "ideas": [
                    "Add unexpected gentle touches—a flower petal on the cheek, a soft fabric to feel",
                    "Whisper something sweet at each stop"
                ]
            },
            {
                "number": 3,
                "title": "Tactile Hints: The Secret Language",
                "content": "Instead of words, use touch. A light push on the shoulder = step forward. Touching the hand = turn. Squeezing the palm = stop. This becomes your secret language of trust.",
                "ideas": [
                    "Create your own unique signals",
                    "Try navigating an entire room using only touch"
                ]
            },
            {
                "number": 4,
                "title": "Final Stage: The Surprise",
                "content": "The last spot is the romantic finale: a slow dance hugging to a song, a tea party, or tasting something delicious. Then switch roles! The second partner rearranges the route and adds their own surprises.",
                "ideas": [
                    "After both runs, discuss the feelings: Was it harder to trust or to lead?",
                    "Take a photo with the blindfold and caption it \"The Most Romantic Maze\""
                ]
            }
        ]
    },
    "gamedevnight": {
        "heroEmoji": "👾",
        "title": "Game Dev Night: Build Your World - Date Plan",
        "subtitle": "Date Plan",
        "heroTitle": "Game Dev Night: Build Your World",
        "heroSubtitle": "Tonight you become indie game developers, creating something playable from scratch. No coding experience needed—just imagination, teamwork, and the thrill of seeing your bizarre ideas come to life on screen",
        "sectionTitle": "The Process: \"From Idea to Play\"",
        "checklist": [
            {
                "title": "The Engine",
                "items": [
                    "A laptop with Scratch (scratch.mit.edu—free, no download needed) or Puzzlescript (puzzlescript.net) for puzzle lovers"
                ]
            },
            {
                "title": "Design Studio",
                "items": [
                    "Paper and pencils for sketching ideas",
                    "sticky notes for brainstorming",
                    "a whiteboard or large paper for planning"
                ]
            },
            {
                "title": "The Vibe",
                "items": [
                    "Ambient video game soundtracks (Zelda, Stardew Valley, Minecraft)",
                    "energy drinks or coffee",
                    "snacks for the midnight crunch"
                ]
            }
        ],
        "dresscode": [
            {
                "emoji": "👾",
                "title": "Indie Developers",
                "description": "Hoodies, headphones around neck, slightly sleep-deprived look"
            },
            {
                "emoji": "🚀",
                "title": "Game Studio Founders",
                "description": "Matching t-shirts—you're a team now"
            },
            {
                "emoji": "🎮",
                "title": "Retro Gamers",
                "description": "Vintage gaming tees, comfortable sweatpants"
            }
        ],
        "topics": {
            "show": true,
            "icon": "🎯",
            "title": "Game Concept Ideas",
            "items": [
                "A maze where you guide \"us\" (two characters) to find each other",
                "Catch falling hearts/pizza/cats while avoiding responsibilities",
                "A tiny platformer where you jump over your real-life annoyances",
                "Quiz game: \"How well do you know your partner?\"",
                "A story game about your first date with silly choices"
            ]
        },
        "steps": [
            {
                "number": 1,
                "title": "The Pitch Meeting: What Are We Making?",
                "content": "Every great game starts with a wild idea. Sit together and brainstorm for 15 minutes. No idea is too stupid—a game about a cat delivering tacos in space? Write it down. A platformer where you jump over your partner's bad habits? Perfect. Pick the concept that makes you both laugh or gets you most excited.",
                "ideas": [
                    "Each person pitches 3 game ideas in 30 seconds each, like a real pitch meeting",
                    "Combine two random ideas: \"What if Tetris met our relationship story?\"",
                    "Base it on an inside joke only you two understand"
                ]
            },
            {
                "number": 2,
                "title": "Role Assignment: Dream Team Formation",
                "content": "Divide the roles based on what excites each of you. One person can be the Lead Designer (decides how the game works, what happens when), while the other is the Art Director (how it looks, character design, colors). Or switch halfway through! In Scratch, one can drag code blocks while the other draws sprites.",
                "ideas": [
                    "Art Director: Draw your main character on paper first, then recreate it in the sprite editor",
                    "Lead Designer: Write down the \"rules\"—what makes you win? What makes you lose?",
                    "Sound Engineer (both): Pick silly sounds from the library for every action"
                ]
            },
            {
                "number": 3,
                "title": "The Build: Making Magic Happen",
                "content": "Now the real fun begins. Open Scratch and start creating. Begin with something tiny—make a character move with arrow keys. Then add one thing at a time: a goal to reach, an obstacle to avoid, a sound when you score. Celebrate every small victory. Your character moved? High five! It makes a sound? Victory dance!",
                "ideas": [
                    "Start with Scratch's tutorial game (takes 10 min) to learn the basics together",
                    "Keep it simple: one screen, one goal, one obstacle is enough for a complete game",
                    "Add each other as characters—draw yourselves as pixelated sprites",
                    "Include a secret easter egg only your partner would understand"
                ]
            },
            {
                "number": 4,
                "title": "Playtest Party: Bug or Feature?",
                "content": "Your game is \"done\" (games are never truly done). Now play it! Take turns, try to break it, find the funny glitches. That weird bug where your character flies off screen? Maybe that's a feature now. Rate each other's contributions and debate whether that impossible jump is \"challenging\" or \"unfair.\"",
                "ideas": [
                    "Keep a \"bug list\" but rename the funniest bugs as \"surprise features\"",
                    "Compete for the high score in your own game",
                    "Record each other's reactions while playing"
                ]
            },
            {
                "number": 5,
                "title": "Final Chord: Launch Day",
                "content": "Your game exists! It's real! Give it a proper title and write a dramatic description like it's on Steam. Scratch lets you publish and share—you now have a game on the internet that you made together. Save the link forever.",
                "ideas": [
                    "Write ridiculous \"reviews\" for your game: \"10/10 changed my life\" —Your Cat",
                    "Plan a sequel for your next game dev date",
                    "Share with one friend and watch them play via video call",
                    "Screenshot the finished game and make it your phone wallpaper for a week"
                ]
            }
        ]
    },
    "claynight": {
        "heroEmoji": "🧁",
        "title": "Clay Night: Sculpting Nonsense - Date Plan",
        "subtitle": "Date Plan",
        "heroTitle": "Clay Night: Sculpting Nonsense",
        "heroSubtitle": "Get your hands dirty and your hearts light. Tonight you're sculptors with zero expectations—just squishy clay, silly creations, and the joy of making something weird together",
        "sectionTitle": "The Process: \"Masterpieces of Imperfection\"",
        "checklist": [
            {
                "title": "The Clay",
                "items": [
                    "Air-dry clay, plasticine, or Play-Doh—whatever you can find",
                    "a few colors make it more fun"
                ]
            },
            {
                "title": "Tools",
                "items": [
                    "Toothpicks, forks, and butter knives work perfectly",
                    "a cutting board or plastic mat to protect the table"
                ]
            },
            {
                "title": "The Vibe",
                "items": [
                    "Lo-fi beats or Studio Ghibli soundtracks",
                    "warm lighting",
                    "wine or hot chocolate within reach (not too close to the clay!)"
                ]
            }
        ],
        "dresscode": [
            {
                "emoji": "🎨",
                "title": "Messy Artists",
                "description": "Old t-shirts you don't mind ruining"
            },
            {
                "emoji": "👶",
                "title": "Kindergarten Throwback",
                "description": "Your most childish, playful clothes"
            }
        ],
        "topics": {
            "show": false
        },
        "steps": [
            {
                "number": 1,
                "title": "Warm-Up: Blind Sculpting",
                "content": "Start with a silly warm-up. Close your eyes and try to sculpt a simple animal in 2 minutes. No peeking! When the timer goes off, open your eyes and try to guess what your partner made. Laugh at the beautiful disasters. This removes all pressure to be \"good.\"",
                "ideas": [
                    "Try cat, snail, or elephant—simple shapes, hilarious results",
                    "Rate each other's creations on a scale of \"what is that\" to \"almost recognizable\""
                ]
            },
            {
                "number": 2,
                "title": "Sculpt Your Partner",
                "content": "Now for something sweet. Each of you sculpts a tiny version of the other person. It doesn't need to look realistic—capture their vibe, their essence, their most recognizable feature. Big smile? Wild hair? Always wearing headphones? That's what matters.",
                "ideas": [
                    "Don't show each other until both are done—the reveal is the best part",
                    "Add tiny details that only you would notice about them",
                    "Keep these forever as the ugliest, cutest gifts you've ever exchanged"
                ]
            },
            {
                "number": 3,
                "title": "Build-a-Memory",
                "content": "Work together on one scene from your relationship. Your first date spot? The couch where you watch movies? Your dream vacation destination? Build it together—one person makes the base, the other adds details. No planning, just vibes.",
                "ideas": [
                    "Recreate the meal from your first dinner together (tiny clay pasta!)",
                    "Build your apartment in miniature with all its quirky details",
                    "Make your pet, real or imagined"
                ]
            },
            {
                "number": 4,
                "title": "Final Chord: The Gallery of Us",
                "content": "Line up all your creations on a shelf or windowsill. Take photos. Admire the chaos. These lumpy, imperfect little sculptures are now artifacts of this night—proof that you don't need to be good at something to have fun doing it together.",
                "ideas": [
                    "Write tiny museum labels with dramatic titles: \"Figure #1: The Artist's Muse (2024, clay, questionable skill)\"",
                    "Let the air-dry clay harden and keep your favorites",
                    "Start a tradition: add one new sculpture every few months"
                ]
            }
        ]
    },
    "magicnight": {
        "heroEmoji": "🪄",
        "title": "Magic Night: Tricks Up Your Sleeve - Date Plan",
        "subtitle": "Date Plan",
        "heroTitle": "Magic Night: Tricks Up Your Sleeve",
        "heroSubtitle": "Tonight you become mysterious illusionists, learning simple tricks and performing a private magic show for an audience of one. All you need is a deck of cards, a few household items, and the willingness to say \"Is this your card?\" with a straight face",
        "sectionTitle": "The Process: \"The Art of Wonder\"",
        "checklist": [
            {
                "title": "The Essentials",
                "items": [
                    "A standard deck of cards",
                    "a few coins",
                    "rubber bands",
                    "paper and pencil"
                ]
            },
            {
                "title": "The Classroom",
                "items": [
                    "Phone or laptop for watching tutorials",
                    "a table with good lighting to practice"
                ]
            },
            {
                "title": "The Vibe",
                "items": [
                    "Mysterious jazz or piano music",
                    "dim lighting with one spotlight on your \"stage\"",
                    "maybe a candle for dramatic effect"
                ]
            }
        ],
        "dresscode": [
            {
                "emoji": "🎩",
                "title": "Classic Magicians",
                "description": "Black clothes, a makeshift cape from a blanket, mysterious vibes"
            },
            {
                "emoji": "✨",
                "title": "Street Magic Style",
                "description": "Casual but cool—dark hoodie, confident attitude"
            },
            {
                "emoji": "🃏",
                "title": "Card Sharks",
                "description": "Vests, rolled-up sleeves, dealer energy"
            }
        ],
        "topics": {
            "show": true,
            "icon": "🎴",
            "title": "Easy Tricks to Learn (YouTube Search Terms)",
            "items": [
                "Card tricks: \"21 card trick tutorial\", \"self-working card tricks\", \"best easy card tricks for beginners\"",
                "Math/mind reading: \"1089 math trick\", \"grey elephant from Denmark trick\", \"magic number prediction trick\"",
                "Coin tricks: \"coin vanish for beginners\", \"coin behind ear trick tutorial\"",
                "Rubber band: \"jumping rubber band trick\", \"rubber band through thumb\"",
                "Paper tricks: \"paper to money trick\", \"impossible paper cut trick\""
            ]
        },
        "steps": [
            {
                "number": 1,
                "title": "Magic School: Pick Your Tricks",
                "content": "Separate for 20-30 minutes. Each of you picks 2-3 simple tricks to learn from YouTube tutorials. Don't peek at what your partner is learning! Focus on \"self-working\" tricks—they require no sleight of hand, just following steps. The 21 Card Trick and the 1089 Math Trick are perfect starters.",
                "ideas": [
                    "Search \"self-working card tricks\"—these practically do themselves",
                    "The \"Grey Elephant from Denmark\" mind-reading trick needs zero props",
                    "Pick one card trick, one non-card trick for variety",
                    "Practice until you can do it without looking at the video"
                ]
            },
            {
                "number": 2,
                "title": "Rehearsal Time: Perfect Your Act",
                "content": "Still separate, practice your tricks until they feel smooth. But here's the secret real magicians know: the trick is only 20%—the performance is 80%. Work on your patter (the story you tell while doing the trick), your misdirection, your dramatic pauses.",
                "ideas": [
                    "Create a magician persona with a silly stage name",
                    "Practice your \"magic words\"—make up your own or use classics",
                    "Rehearse in front of a mirror to see what your audience sees",
                    "Prepare a recovery line in case something goes wrong (\"That's what I wanted you to think!\")"
                ]
            },
            {
                "number": 3,
                "title": "Showtime: The Private Performance",
                "content": "Dim the lights. One person becomes the magician, the other the amazed audience. Perform your tricks with full commitment—dramatic flourishes, mysterious pauses, the whole show. The audience's job? Be the best audience ever. Gasp. Applaud. Act amazed even if you spot the secret.",
                "ideas": [
                    "Introduce yourself with your magician stage name",
                    "Build tension: \"I'm only going to do this once...\"",
                    "End each trick with a dramatic reveal and hold for applause",
                    "After all tricks, switch roles and repeat"
                ]
            },
            {
                "number": 4,
                "title": "Final Chord: Secrets Revealed",
                "content": "After both shows, sit together and teach each other your tricks. Seeing how it works doesn't ruin the magic—it's a different kind of fun. Now you both have 4-6 tricks in your pocket for parties, nephews, or boring waiting rooms.",
                "ideas": [
                    "Agree on one \"signature couple trick\" you'll both learn perfectly to perform together",
                    "Plan to surprise friends at the next gathering with your new skills",
                    "Start a \"trick library\"—add one new trick every few months"
                ]
            }
        ]
    },
    "dreamhome": {
        "heroEmoji": "📐",
        "title": "Dream Home: Blueprints for Two - Date Plan",
        "subtitle": "Date Plan",
        "heroTitle": "Dream Home: Blueprints for Two",
        "heroSubtitle": "Tonight you're architects of your future, designing the home you'll someday share—from the absurdly practical to the wildly extravagant. Whether on paper, in an app, or in The Sims, every room becomes a conversation about how you want to live",
        "sectionTitle": "The Process: \"Building Dreams Room by Room\"",
        "checklist": [
            {
                "title": "The Drawing Board",
                "items": [
                    "Large paper and pencils/markers for sketching",
                    "OR free apps: Floorplanner.com, Planner 5D, RoomSketcher",
                    "OR The Sims (any version) if you have it"
                ]
            },
            {
                "title": "Inspiration",
                "items": [
                    "Pinterest boards with dream homes",
                    "saved Instagram posts",
                    "or just your imagination"
                ]
            },
            {
                "title": "The Vibe",
                "items": [
                    "Calm acoustic music or lo-fi beats",
                    "tea or wine",
                    "cozy blankets—you're dreaming, after all"
                ]
            }
        ],
        "dresscode": [
            {
                "emoji": "📐",
                "title": "Architects at Home",
                "description": "Comfortable but put-together—you're professionals making important decisions"
            },
            {
                "emoji": "🏠",
                "title": "Future Homeowners",
                "description": "Your coziest loungewear—you're already home"
            }
        ],
        "topics": {
            "show": true,
            "icon": "🏡",
            "title": "Questions to Spark Ideas",
            "items": [
                "City apartment with a view or countryside house with land?",
                "Open-plan kitchen or separate cozy rooms?",
                "What's the one ridiculous room you secretly want? (Library? Home cinema? Indoor hammock room?)",
                "Bathtub or walk-in shower? (This matters more than you think)",
                "Where does the cat/dog/future pet sleep?"
            ]
        },
        "steps": [
            {
                "number": 1,
                "title": "The Wishlist: Dreams Without Limits",
                "content": "Start with zero restrictions. Take 10 minutes each to write down everything you'd want in a dream home—no budget, no physics, no logic required. A rooftop garden? A secret room behind a bookshelf? A slide instead of stairs? Write it all. Then share your lists and find the overlaps. These are your non-negotiables.",
                "ideas": [
                    "Include silly things—a room just for naps, a wall of cereal dispensers",
                    "Think about feelings, not just rooms: \"a spot where morning light hits perfectly\"",
                    "Note what you want to avoid too: \"no carpet ever\" or \"no open toilet concept\""
                ]
            },
            {
                "number": 2,
                "title": "The Floor Plan: Laying the Foundation",
                "content": "Now bring it back to earth (a little). Start sketching or building your floor plan. Work room by room, making decisions together. Kitchen first—it's where fights and feasts both happen. Then living areas, then private spaces. In The Sims, one person controls while the other directs—switch every room.",
                "ideas": [
                    "On paper: Use graph paper or just draw rough shapes—scale doesn't matter, ideas do",
                    "Floorplanner.com: Free, simple drag-and-drop, looks surprisingly professional",
                    "The Sims: Set money cheats to unlimited (motherlode!) and go wild",
                    "Debate door placements—this gets surprisingly passionate"
                ]
            },
            {
                "number": 3,
                "title": "The Details: Making It Yours",
                "content": "Zoom into the details that make a house a home. What color are the kitchen cabinets? Is there exposed brick? What's the vibe of the bedroom—minimalist calm or cozy chaos? Add furniture, pick materials, argue about whether the toilet seat stays up or down (install two bathrooms).",
                "ideas": [
                    "Design your bedroom together—bed placement reveals a lot about a person",
                    "Plan a \"guilty pleasure\" space for each of you: gaming corner, reading nook, craft zone",
                    "Include space for traditions: where's the Christmas tree going? Where do you eat Sunday breakfast?",
                    "Don't forget outdoor space: balcony garden, grill area, hammock spot"
                ]
            },
            {
                "number": 4,
                "title": "The Tour: Walking Through Your Future",
                "content": "Your home is designed. Now give each other a tour. Walk through it room by room—describe the morning light in the kitchen, where you'll sit to read, what you see out of each window. Make it vivid. This isn't just a floor plan anymore; it's a preview of life together.",
                "ideas": [
                    "Describe a typical morning in this house, from waking up to leaving for work",
                    "Narrate hosting your first dinner party here—where does everyone sit?",
                    "Fast-forward: \"When we're 70, we'll sit here and...\""
                ]
            },
            {
                "number": 5,
                "title": "Final Chord: Save the Blueprint",
                "content": "Save everything. Screenshot it, photograph it, export the file. This isn't just a drawing—it's a document of who you are right now and what you're dreaming toward. Tuck it away somewhere you'll find it in 5 or 10 years.",
                "ideas": [
                    "Print the floor plan and put it in your time capsule if you have one",
                    "Create a shared Pinterest board for inspiration you find over time",
                    "Set a calendar reminder to revisit and update the design in one year",
                    "If using The Sims: actually play a day in your dream house as yourselves"
                ]
            }
        ]
    }
}
